{
    "finding_joy_in_simple_living_what_brings_you_peace": {
        "title": "Finding Joy in Simple Living - What Brings You Peace? : r/simpleliving",
        "text_body": "Hey everyone,I've been part of this community for about a week now, and I'm really moved by the peaceful and inspiring stories shared here. I'm on a journey to embrace simple living and find more joy in the little things.One of my favorite moments recently was spending an entire afternoon reading a book in the park. It was such a refreshing break from the usual hustle and bustle.What are the small, simple things that bring you peace and happiness in your daily life? I'd love to hear your experiences and ideas.Thanks for sharing and being such a wonderful community!Read more",
        "comments": [
            "Noticing all the things that give you joy is a vital part of simple living.I work from home and there are days that I don't leave the house. I have to purposely schedule in walks or I get too busy to effortlessly slot them into my day. A 1-2 hour walk somewhere lovely is good for mental health and for my body. I always feel refreshed after a walk.Smaller than that is having a 5 minute break from my work to canoodle with my pet rabbits. They usually snooze and cuddle with each other during the day so I interrupt that and thrust my face upon them. One rabbit loves kisses, the other only tolerates them but it gives me joy to kiss them.",
            "I love rabbits!  What kind do you have?As for walks, sometimes I use the Randonautica app just for a different kind of walk.  I found it during lockdown in 2020 and it's really fun.",
            "I hate that it's out of my control, but whenever it rains hard, especially when it thunders, I'm completely capable of just stopping whatever I'm doing and just existing. Sometimes I'll even go into my garage and just sit down and watch the rain.Something else that I've started doing recently is just listening to music. Just listening and not doing anything else. Most of my life I never liked to have music on even in the background, but now that I'm in my late 30s I'm finally starting to get into music, listening to all the artist and songs I heard people talk about for decades, finally understanding what the fuss was all about. A few weeks ago I sat down and listened to a whole Pink Floyd album front to back. That was the first time I ever just sat down and focused on music for that long. Now it's like a whole new world has opened up to me, because plenty of music is an experience all by itself. It doesn't need to be attached to a movie or a videogame, it's the full package by itself.",
            "Dark Side of the Moon is usually the Pink Floyd album people listen to first.  If that was your choice then it's excellent, but can I also recommend Animals as a second PF album and then their song Echos!",
            "Ok, so don't mock me, but I love cleaning my kitchen.  I have no idea why, but it just brings me joy.  It might be the smell of the cleaning supplies or just the scrubbing which frees my mind, I don't know.  But it's so peaceful.I also love going to my mom's house and visiting her dog.  Her dog is a chihuahua mix and is the most chill, zen dog in the world.  She scoots over when I'm sitting on the sofa so her butt touches my hip and she just sits there, almost mindfully.  I rub her head and if I stop, she lifts her left paw to swipe at the air twice and I know that's her telling me that I'm not done yet.  hahaI love to cook and feeding people I love is a blessing.I love taking socks fresh out of the dryer and putting them on.  So cozy and warm.Fresh iced tea is a joy.",
            "A morning at the library, followed by a hot or iced coffee and reading at the park.I love going for drives. I love exploring random roads and discovering dead ends and new places. I park and watch people and animals go by.",
            "Going to the ocean and taking in the vast blue is my favourite way to lift my spirits and find serenity. I also love reading in the park as well. That still time in nature is a great restorer. I love reading poetry at night with my beloved. A long bath with candles and sacred music. Baking bread, the waft of it through the house and making a traditional hearty soup, it's almost winter here. Painting on canvas is very healing for me, or just drawing. Reading a magical novel tucked in bed with tea whilst it rains outside is bound to bring a lot of calm. Gardening brings you back down to earth, grounds you and heals many people. Oh gosh there's just so many beautiful ways to find that peace.",
            "The most peaceful part of our day is when the sunlight is going down, my husband plays his guitar and I knit. A simple thing.",
            "My peak Simple Living day was about a month ago. I awoke before 8am with no plans for the day. I decided to go to breakfast, then took a bus (since I sold my car to my son and choose not to own one) to the mall to get the Doc Martens shoes I've been wanting for a few months, where, when I was telling the salesperson I couldn't decide on black or brown, a random woman with her husband said, “oh go with the brown, you look really good today” 🙂, then to the lakefront to take a picture of me looking good 😁 to post on a dating site, then cleaned what I felt like cleaning and worked on what I felt like working on. I aspire to be that guy all the time.",
            "Today I took a walk around my neighborhood and took photos of the flowers people have in their yard (near the sidewalk of course). So many roses to see right now and I met and talked with a neighbor.I live near a university and take classes in English literature through their community ed program. I love the lack of pressure and it's fun to talk with other people who also love reading.I recently bought a ukelele because I like to sing. I learned \"Jesus Don't Want me for a Sunbeam\" by the Vaselines."
        ]
    },
    "found_inner_peace_but_there_is_nothing_there": {
        "title": "Found Inner Peace but there is nothing there. : r/Mindfulness",
        "text_body": "I'm 43 years old now, I have experienced many traumas in my life that caused me to have major depression for most of my adult life.  Three years ago, I had come to certain realizations of myself and my surroundings, accepting what was which helped release my depression.  Over this time I have had bouts of inner peace.Over our lives people discuss the values of finding peace, article after article saying that peace is all you need.  When I first experienced inner peace I didn't know what to think because I didn't think during these moments.  After the peace would fade I would contemplate it.  I would go by other people's vision where you should seek to hold onto this peace continually, so I sought more peace.Inner peace only showed itself in moments of realization of self and surroundings.  The only way to do this was to ask questions about self and surroundings to find answers.  Some bouts of inner peace lasted weeks, others lasted minutes.  Upon asking myself certain questions lately I came to the realization of what inner peace is.Inner peace is void of emotion, an empty mind, a slowness to a pause.  There was no satisfaction in the moment just emptiness.  It's almost like you are asleep experiencing only the void.  I do not understand what could be gained from this.One's life is always changing, for me my beliefs are always changing after finding answers and even those answers change with more answers.  My life is very simple as I am a simple person, mentally I am just not capable of societies demands, so I sit and question life.  Perhaps my understanding will again change over time.EDIT:  I kinda wonder if a lot of you posting even read my post rather than just the topic headline.Read more",
        "comments": [
            "Your definition of peace and being able to find it may be in error… mindfulness can never “get” you anything. Love, peace, serenity, happiness. For me mindfulness showed me what's there in the undefined, and that being there with that, is ultimately peaceful, once you drop it all. If you're feeling like your experience is empty or void, maybe ask yourself what you were expecting to be there, and whether that expectation was the issue.",
            "For me inner peace isn't achieving a state of nothingness. That sounds more like detachment than anything. It's mostly been about not resisting what is happening so much and getting my body out of that sub perceptual fight or flight feeling.You want to feel more in tune with everything around you. When I feel more at peace and at ease my focus and internal dialogue is generally less about myself and more focused outward onto the world on others and things. I'm more likely to share with others and want to connect. I'm able to see reality more for what it is rather than projecting on to it through insecurity and anxiety. I also feel emotions more deeply as I'm more in touch with them rather than resisting them.",
            "The teachings talk about this. It is the problem of emptiness. The wrong type of emptiness..",
            "M26, same, same. Gl Hf",
            "I think if we find ourselves suffering, join the club. Then begins the quest to relieve our suffering.  We try everything to satisfy our senses but then the 2nd rule of the universe kicks in (It all changes). Back to square one.With samadhi (jhana practice) we do find relief, temporarily while we are meditating, but we can't meditate forever. So back into the world we go. But now we somehow go in differently.  Our mindfulness/investigation that we do when Samadhi kicks us back into the world, has now changed, as if the samadhi has sharpened a knife that we now wield to go deeper into the world. Then surprise, surprise, as each worldly experience that we once believed was full eventually becomes empty, right along with that emptiness, and in concert with it, comes an exposure to something quite inexplicable like a new realty that we can't really explain - But boy do we feel it.",
            "To me, that's sounds more like shutting down than peace. I think the inner peace has more to do with appreciation and confidence we can properly handle difficult situations. Maybe the teachings of Thich Nhat Hanh could be relevant?"
        ]
    },
    "how_do_i_achieve_peace_i_want_nothing_more_that_a": {
        "title": "How do I achieve peace? I want nothing more that a stress-free life. : r/simpleliving",
        "text_body": "Edit: thanks everyone, I am reading every comment and really appreciate all the help and support.I am 20 years old. Many people say the peak of your life.I am quite an unhappy person. I am lucky to be intelligent enough, I have a nice family, some good friends. However this is counterbalanced by my high levels of anxiety and lack of motivation.I am currently doing a degree which I've only recently realised is notentirelyuseless but not particularly versatile. I also don't enjoy it one bit and don't really want any jobs relating to my degree anyway. I have no passion for any particular job. I really wish I did.Because of my general and social anxiety I often dread having to work for the next 40-50 years of my life. I don't deal with stress well at all. All the networking, meetings, presentations, smalltalk, being told off by bosses, the independence and responsibility... It fills me with dread.I want to escape this life but have no realistic way of doing so.I dream of having a small plot of land where I can garden most of the day and go on runs/walks whenever I want and read books and meditate. I don't want a 9-5 job.I realise to some this is a first-world problem, and to others I just appear lazy. Maybe it is, and I am, but to me I just feel lost and I can't find the path.Sorry for rantingRead more",
        "comments": [
            "I am 20 years old. Many people say the peak of your life.I don't think anyone older than their 20s says that.All the networking, meetings, presentations, smalltalk, being told off by bosses, the independence and responsibility… It fills me with dread.Sounds like you are describing your perception of corporate life. Do something else.I want to escape this life but have no realistic way of doing so.Of course you do. No matter what you can think of, someone out there will pay you to do it.",
            "Yeah 20 years old is in no way a peak IMO. In my experience, life gets better over time. You learn from your mistakes. You become more of yourself. Hopefully you heal your childhood trauma, to whatever extent that's possible. You slowly evolve into the person you were always meant to be. In the US, public education and even sometimes college is really just weird indoctrination. Suffering is part of life and without the bad days we wouldn't know what a good day feels like. Just don't give up and things will get better.",
            "Hi friend. You're doing just fine. These are great realizations you are having.A few thoughts:-If you are close to finishing your degree, I'd recommend finishing it. Having a bachelors degree opens many doors for employment. Many jobs don't even care about what your degree is in and care more about your skill set, soft skills, etc.-If you love gardening that much, what if you found a job gardening for someone else's land? There are likely landscaping companies that may offer some further education about horticulture that may end up being useful to your own garden in the future.-What about a career as a park ranger, grounds keeper, or something to that effect?-You do not have to live a life at a desk job. There is a whole world out there. Let the anxiety of being doomed to a certain type of job go. You are in control of your life. There are ways to design your life to meet your goals. In fact, I'd recommend the Design Your Life book (with the workbook). It may give you the planning and foresight you are looking for.Your whole life is ahead of you! Best of luck.",
            "There's no such thing as a stress free life. And there is good stress and bad stress. But you're not in a spot to hear that right now.As others have posted, there are alternatives. I would suggest that you find some line of work in which you can be your own boss; that way the motivation to progress is not imposed upon you; it comes from you. But you will have to work because your dream requires money and not just a tiny amount. At your age and if you iive in the US, you will be largely responsible for your expenses for when you cannot or don't want to work any longer.So maybe what you should do now is find a counselor who can help you explore the issues behind what tbh sounds a little like depression. That person also can reflect to you some common threads of interest and concern to you.",
            "Your feelings are perfectly normal and reasonable.  No one wants to work a 9-5 job, but we do it because we can use the money and benefits to build a life that appeals to us.  I also would love to spend time in the garden all day, take hikes everyday, and care for stray and abandoned cats.  But I need money for food, clothes, shelter, transportation, so I have to work.But not all jobs are created equal.  I have a job that is not physically demanding, is a short 10 minute commute from home, and one which does not create extra stress in my life.  My job pays for gas in my car so I can go hiking after work and on the weekends.  My job pays for a house where I can live by myself and get away from the world every night.  My job pays for delicious food.Tldr: Try to find a job that allows you to live the life you desire in the evenings and on weekends.  It's not perfect, but it feels worth it to me when I get to hike out to waterfalls and mountains and see beautiful cats on the weekends.",
            "A job like that does sound nice. I think listening to my parents and brother come home from work talking about the crappy sides of their jobs doesn't help. Thanks again",
            "First, Your 20's are not the peak of your life. You have much life to live.Let go of expectations, yours, and others.  I question if you chose the degree or if others expected it of you. Your soul is already telling you it doesn't align with your path.Follow your dream and find a way to support yourself that doesn't suck the soul out of you. It's your life, live it how you want, not as others expect you to.Lastly, If you feel lost and off the path then you are. Life will continue to circle around until you are on the right path. Trust your gut. Be the author of your book, don't let others write it for you.Peace comes from being your authentic self.",
            "These questions at 20 is a great head start, friend.I finally found the peace I was after at 29 by going into the woods alone for a while. A campfire, stars, trees, rivers... something about just witnessing where it all comes from without the chatter cleared it all for me.I can go back to that peace whenever now.The natural world is quiet, it listens to itself, and goes on without any help from our endless opinions. Peace is all around after you stop trying to solve things and just listen.Also, in my 30s with a big quiet garden and can say, you're goals are in the right place :)20s are prickly, hang in and you'll get there.",
            "Use your mind to come up with creative ways to accomplish what you are after. I am 23 and currently work in an office environment. I'm not sure I'm opposed to offices or corporate work entirely, but I'm having some tough times at work these days. In spite of that, I'm still enjoying myself thoroughly outside of work, going on runs, taking walks in the woods, reading, doing puzzles, watching Netflix, etc.But I'm also allowing myself to dream about my next moves and where I'll go. Traveling, jobs, etc., I just keep thinking of what I know how to do, what I could learn, how to get there and what comes next. I don't know, but I'll figure it out. Even now, I have a rough timeline of how I will move from where I am now to where I'm going next. Life is a rich tapestry of experiences. Instead of seeing the things that restrict you (i.e. an irrelevant and unpleasant degree/sector, despising networking and corporate world, etc.), think about the possibilities! Flipping the script and getting excited about future possibility can have a wondrous effect on life.I like to imagine the open road ahead of me with excitement, realizing that I can take the next several years of my life to keep experimenting until I nail down who I am and what I really want. I feel fortunate enough to have a degree already and thus have a multitude of options in front of me. I'm restless, but I'm glad I am aware enough of what really matters in life that I am thinking intentionally about it. I try to accept that the current turmoil is simply a way of currently protecting myself from having a mid-life crisis later. Happy to directly chat via DMs if you want to strategize further how to try things out. Reject the script that life must go a certain way! You're doing great :)",
            "First off - who says 20 is the peak? That is crazy. 20 is still so young and underdeveloped."
        ]
    },
    "how_do_i_be_at_peace_while_doing_nothing": {
        "title": "How do I be at peace while doing nothing? : r/simpleliving",
        "text_body": "I'm a final year law student with 3 months left for graduation and throughout my 5 year long course, I've been involved in campus committees and have been interning and doing some part time work (content writing). I got a job through campus recruitment 5-6 months ago and all of my peers who also got placed have been saying that they want to just do nothing and enjoy the rest of the semester since after we graduate we're going to have work like hell anyway. I find it very difficult to not do anything. Anytime I'm not completely overwhelmed with work I start doubting my entire self worth and start feeling like the most useless piece of space in the world. How do I be at peace doing nothing? How do I not feel guilty about having free time?Read more",
        "comments": [
            "I've found it helpful to start with self-compassion.Pick someone you care about a lot (adult, child, pet - anything goes). Imagine for a moment that this individual ties their self-worth to their accomplishments. When they don'tfeelproductive enough (even though others might judge them to be highly productive), they think cruel thoughts about themselves, don't think they deserve self-care, find it difficult to be present with loved ones, and feel a sense of dread and despair.How would you feel, knowing that this is happening to someone you love?The practice of self-compassion is about turning that lens back onto yourself. The immediate result: relief from the feelings you're feeling right now. The long view: opening the door for future you to feel fulfilled and show up for others in ways that current you never thought possible.Source: about a year ago, I started \"deprogramming\" myself from 15-20 years of the belief (notfact) that productivity and achievement = self-worth. It's been fantastic for my mental health and overall happiness.",
            "Thank you for your reply. I think this is an approach that I should definitely try. I tend to be extremely harsh on myself and a single failure or even a tiny bump makes me spiral into the hellhole of 'I'm a failure and I am worthless' and then it just goes on to no end. I definitely need to break the pattern and be a little easier on myself.",
            "Your reply was so thoughtful and gentle.  Thanks for sharing :)",
            "I'll add to this. We are human beings. We do things but we are not human doings. The first step to feeling free from the pressure to constantly do comes when you realize being is enough. And it most certainly is enough. If you are here then your existence is evidence of that. Everything you said is completely perfect. Self compassion is the best thing to find that peace and come to that realization.",
            "What is doing nothing? What is free time? Are you expecting to just stare at a white wall for hours on end? Binge every season of every show on Netflix?Here's the thing — most humans crave productivity. Many people say they “don't want to work” or “just want free time” but what they really mean is “I want to work for myself” and “I want to control how I spend my time.” Given the opportunity, I don't believe most people will watch Netflix for weeks on end, more likely they would “work” doing things they enjoy.So reframe productivity. Reframe “doing nothing.” Go take a walk, go on a hike, go out to lunch with a friend, start a fantasy novel, do whatever you want. You're still being productive, you're just doing it for yourself instead of someone else.",
            "Reminds me of Pascal's quote…\"All of humanity's problems stem from man's inability to sit quietly in a room alone.\"",
            "I finished law school almost 10 years ago and have been a practicing lawyer since. Here's my advice: treat your work and your profession as a part of your life and identity not as your entire life and identity.It's ok to derive satisfaction from being a respected and hard working law student /lawyer. The problem is when you make that you're entire identity. Then you forget yourself and that doesn't lead to healthy outcomes.Likewise, it's okay to derive satisfaction from your studies and legal career but it shouldn't be your entire life. In fact, you should derive satisfaction from it since work does make up an important part of our lives. However, you should have hobbies and relationships outside of that too.What I'm trying to say is that you need to shift your mindset now. The first few years of practice are difficult. They involve a lot of learning and finding a healthy balance between work and life will be difficult. But if you treat your work as work as opposed to your life, you'll find that you'll feel less guilty about having to be productive all the time.Good luck!",
            "You are so much more than your career. Your self-worth seems to be tightly connected to your level of productivity. Do you view others who aren't as driven or aren't as capable as you are as worthless?",
            "Your question made me introspect and I realised that I do to a certain extent view people who aren't as driven to be worthless and I think it comes from many years of receiving praise for being a good kid who works hard and doesn't fuck up. I believe I deserve praise only if I keep up this facade and the moment I fail in life, people are going to see me as the worthless piece of shit I really am. I think I project these insecurities onto others. I have identified the issue. I just need to learn how to unlearn all these beliefs about myself as well as others."
        ]
    },
    "how_to_find_true_inner_peace": {
        "title": "How to find true inner peace : r/Mindfulness",
        "text_body": "Often, when asked about the friendships I treasure most, I find myself reminiscing about those that infuse my life with a sense of tranquility. One such friendship is with Vera, whom I met during my time in Vancouver. Despite our age difference – Vera is over 60 – our shared interests made it effortless to engage in deep, meaningful conversations.What stood out about Vera was her ability to navigate life's challenges with unwavering peace and grace. Intrigued, I once asked her the secret behind her tranquility, and her response, though simple, left a profound impact on me: \"Through a lot of hardships.\"In conversations about inner peace, practices like mindfulness and meditation often take the spotlight, but true inner peace, I've come to realize, is rooted in inner strength, forged through overcoming hardships. A quote from \"The Power of Now\" encapsulates this sentiment: \"The down cycle is absolutely essential for spiritual realization. You must have failed deeply or experienced some profound loss or pain to be drawn to the spiritual dimension.\" This rings true for inner peace as well — building inner strength precedes finding inner peace.Inner strength serves as a grounding force, providing stability when external circumstances threaten to upend us. It is the unwavering belief in oneself when the world offers little support.Throughout my journey, I've distilled three potent practices that have played a pivotal role in cultivating inner strength:1. Embrace the Moments of Silence and StillnessInner strength finds its roots in our sense of inner belonging—a deep connection, acceptance, and alignment with ourselves. To nurture this unshakeable foundation, take moments to embrace silence and stillness. By slowing down, pausing, and appreciating the quietude around you, you can reconnect with your inner self. As external distractions fade away, the voice from your heart becomes clearer, guiding you towards inner peace.2. Practice Deep ListeningThe embodiment of inner strength is often reflected in our relationships through the practice of deep listening. This involves letting go of judgments and assumptions, focusing entirely on the other person. Deep listening is an act of love and confidence, requiring the release of control and the need for validation. It is a skill honed by those with true inner strength.3. Find Your PurposeA sense of purpose serves as an anchor in the ebb and flow of life. Regardless of external circumstances, knowing your purpose allows you to stay focused on what truly matters. Discovering your purpose requires introspection: What brings profound meaning to your life? What fulfills you? What are you willing to pursue, even without external validation or materialistic rewards? How can you leverage your gifts to add value to others' lives?In the pursuit of lasting inner peace, let these practices be your compass, guiding you towards a profound connection with yourself and a resilient inner strength that withstands the tests of time.Written by Tracey Zhang, a purpose-driven writer, coach, and spiritual healer who helps individuals build a strong inner self through major life transitions.Read more",
        "comments": [
            "If you want to find true inner peace, remember this- peace you don't have to find. You just have to still your mind. Because peace is already within us. We have peace. It's just like a still lake. You don't have to make the lake still. You have to stop the ripples, ripples that are created by throwing a pebble in the lake. Those pebbles create ripples. What creates ripples in our mind? It is the mind that bombards us with thoughts -,50 thoughts a minute; 50,000 thoughts a day. How can there be peace of mind? We have to remember that if we want peace, then we must eliminate the mind. Where there is a piece of mind, there cannot be peace of mind. People always say that they want peace of mind. Peace is within. Still the mind, kill the mind, eliminate the mind. And peace you will find.",
            "It's really great to read!...Absolutely, enjoyed it a lot...!",
            "This is lovely and rings so true!",
            "I enjoyed it, thanks.",
            "I find number 3 hard. Can't your life purpose be to cultivate inner strength and peace? Or maybe just be the best human being you can? I'm 40 and still couldn't find other purposes than those",
            "I find number 3 hard. Can't your life purpose be to cultivate inner strength and peace? Or maybe just be the best human being you can? I'm 40 and still couldn't find other purposes than thoseAbsolutely! Cultivating inner strength and peace, or striving to be the best human being you can, are meaningful life purposes. It could be helpful to be more specific about what \"the best human being\" means to you. What personality traits or values resonate with that vision? Identifying actionable steps towards embodying your best self can bring clarity and empowerment. As they say, clarity is power. When you have a clear understanding, you've found your purpose."
        ]
    },
    "is_being_at_peace_more_important_than_happiness": {
        "title": "Is being at peace more important than happiness? : r/DeepThoughts",
        "text_body": "By peace I mean a sense of satisfaction with your life. I long for so much on a daily basis and can't even begin to go on the journey to accomplish those ambitions. Even then lots of those experiences are lost to time. Missed opportunities. If I were happy what if I wasn't at peace? Would that feel better than suffering but being at peace? I find that the more I live the more I'm chasing a feeling of being satisfied with my life rather than being happy. Maybe that peace will bring that happiness? Whenever I'm doing the things I need to do in order to survive all of these longings go away though and I feel satisfied from the work I've accomplished.What does it mean to be human? How can I make the most out of this life? How can I become a completed version of myself? These questions spin around me unending.Read more",
        "comments": [
            "I think they are connected when you introduce wisdom into the mix. So being at peace will almost always lead to happiness. Thats how it worked for me at least.They are separate when your happiness is unfounded and is merely a state of euphoria, ignorance is bliss vibe, dont say nothing dont see nothing stance, happiness from exciting events or dependent on other people. All these states, ask you turn a blind eye to the injustices, focus on whats next, and socialize for happiness. You could say these are happy things but they are not everlasting happiness. The longest short term or partial happiness would be from financial security. It relieves a lot of stress, and you can splurge money whenever you are sad to get momentary happiness. That happiness is fine I guess since its you by yourself depending on yourself alone but peace might not be there.Now talking about peace. You already defined it as being satisfied with what you have. It doesn't mean you don't want more and you wont work towards better things. It means you are content, mentally secure with how everything is working out. Things are gradually falling into place and while there are periods of anxiety and stress, they may just be short lived given the greater picture seems to be on path. Thats peace and frankly happiness comes from it when your mind is at ease. Somehow you end up finding more time as well when you know things are falling into place.",
            "What's the difference between happiness and peace? Anytime I wish anyone anything, I start off by saying may you always have pure happiness and peace. It never occurred to me that they may be different concepts. I guess I always thought that peace comes after one achieves their desired level of happiness or what they perceive happiness to be.",
            "Peace to me is a sense of satisfaction with your life and no regrets or longing for anything.",
            "One of the big crazy important understandings of people that has become prominent in the last few decades among psychologists is that people sacrifice their happiness to chase pleasure.Remember, this body and nervous system is adapted to keep us alive in states of relative deprivation with all the biomechanical and neurochemical innovations to stay motivated to eat and make babies in times of scarcity while making stone tools and chasing animals for food.  Evolution did not design us to be happy, it designed us to survive and make copies of ourselves.I study Buddhism, and one of the main idea in Buddhism is that beings suffer because they put too much energy into chasing after pleasure (the second noble truth of Buddhism).  People can get \"unstuck\" from the habits of the mind that don't serve long-term well-being and compassion.  It takes effort, insight, and kindness.",
            "You know how people say \"happiness is a state of mind\"?  I believe that.As far as peace, peace is a state of the soul.Those are my definitions between the two, simply put.",
            "Or simplified: Is relief better then pleasure?",
            "I kind of see the two as intertwined with one another.",
            "Happiness is fleeting. It comes with a ebb and flow. The duality of it is you will be happy some and unhappy some in life.However, if your able to find peace despite a hardship or the fluctuating of good or bad, then that's more of a permanent state of being.If you find peace then you can be at peace during good and bad situations.There's more intricate views I have about this but this is all I'm in the mood for typing out currently lol.",
            "Nice point",
            "I'd say that they go hand-in-hand. How can you be happy if you aren't at peace?"
        ]
    },
    "is_world_peace_actually_possible": {
        "title": "Is World Peace Actually Possible?  : r/SeriousConversation",
        "text_body": "Looking at the current state of the world, I wonder if there will ever be a point in human history where peace is actually achievable.I'm not talking about any conflict specifically. I'm talking about large scale wars. History shows us how bad things can get. I'm sure we're also all well aware of the potential for nuclear weapons being used at any point right now. It literally threatens the extinction of all species on the planet.I wonder how many people out of the 8 billion would say 'sure let's have an extinction event'? Yet we're all sitting at home and watching it unfold, powerless.But why are we powerless? Why can't we stop it from happening if it's what the majority wants? Of course here we'd get into the complicated aspects of human society, governments etc.We do have the UN right now and apparently the world is much more peaceful now than before according to history. But it's just not enough. I don't claim to have an alternative solution, but I think if we got enough people to seriously think, we could certainly improve things. We've put sattelites in space, getting along and not bombing each other shouldn't be so difficult.I am not against weapons. I believe weapons are necessary to keep (and sometimes enforce) peace. But there should be certain lines we collectively do not cross. Why do we have enough nukes to destroy the whole planet several times over? How do we feel about weapons in space, just casually orbiting around? How about innocent people, children suffering and dying in some war they have nothing to do with?Can we somehow just collectively say 'nope, we won't allow that on our planet'? We could instead be using those resources to improve healthcare, or to educate the millions of children on the planet that have no access to education. It just feels stupid to carry on like this.I think that we as individuals need to start thinking past the lines that are drawn on a map, the flags, the colours, religions, or difference in opinions; and ultimately - hold our leaders accountable. We're all on a tiny rock, floating through space. It sounds obvious, but if we actually worked together, everyone would be better off. If at all achievable, imagine the benefits of a peaceful world.TL;DR: Just chill ffs.Read more",
        "comments": [
            "Moderator AnnouncementRead More »This post has been flaired as “Serious Conversation”. Use this opportunity to open a venue of polite and serious discussion, instead of seeking help or venting.Suggestions For Commenters:Respect OP's opinion, or agree to disagree politely.If OP's post is seeking advice, help, or is just venting without discussing with others, report the post. We'rer/SeriousConversation, not a venting subreddit.Suggestions Foru/EntangledWave:Do not post solely to seek advice or help. Your post should open up a venue for serious, mature and polite discussions.Do not forget to answer people politely in your thread - we'll remove your post later if you don't.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns.",
            "If everyone across the planet had a shared culture with shared values and common goals, you could get close.  But at the end of the day there are few things working against it.Humanity tends to operate on competing interests.  Even if everyone lives under the same flag, some places will inherently have less.  Less resources, less money, less food, less access to trade.  We have that now, and if you're unfortunate enough to be born into that, then you will likely see less representation when decisions are made.  People at the bottom always resent people at the top.  On the other side of that coin, people at the top have a much “easier” time governing if they don't have to acknowledge the interests of people on the bottom.Emotional distance is tied strongly to physical distance.  The farther apart people are, the harder it is for them to truly care about each other.  When people grow emotionally distant, “othering” becomes much easier.  Othering leads to resentment, and resentment leads to conflict.I'm pretty cynical so I could be way off the mark, but I strongly believe that people aren't particularly good at living social groups this big or distant.  I hope it's something we grow into as a species, but that's not something that happens on the timeline of 20-30 generations.",
            "People would have to be ok with agreeing to disagree.Good luck with that.Because when you have hate groups existing in the same world as those they hate, it forms a Paradox.In order to achieve tolerance, the intolerant would have to go. And that's an untouchable stone on so many fronts.",
            "Yeah. Peace of the grave. That's actually quite literally what the peace symbol means: death.Also, we'll be closer to this \"peace\" when we've fully realized world governance.",
            "world peace will be achieved long after humans are gone.war is pointless and for what?  death over religion,  death over money?  death over nothing?haven't we learned anything from the previous wars?the world should be made love to,(not literally)the world need our love, not war.we only have one world,  we shouldn't waste our time with fighting and killing each other with pointless shit.honestly, i would love to fly to war torn countries, and bring peace and love.",
            "World peace requires a global government, which might be worse than some amount of war.",
            "One day yes. But not anytime soon. Human race is a little too crazy. Too many people with \"religious brains\" whether they're in a religion or not. Too many people who are easy to dupe by authoritarian propaganda or are lazy enough to believe something just cause everyone else is or their parents told them to. Elites who's lifestyle means they might as well have grown in a different world, and therefore their desires are at odds with the people.",
            "What, and leave all those profits on the table?!",
            "I'd go look at the last 5000 years one would tend to believe, no.",
            "We haven't had a world war in 79 years so world peace is actually possible."
        ]
    },
    "overthinkers_how_do_you_find_your_peace_of_mind": {
        "title": "Overthinkers - how do you find your peace of mind? : r/socialskills",
        "text_body": "I have a tendencythe vast majority of my problems come from overthinking.I'd estimate nearly 90% of my social skill shortcomings are all in my head.my question is... for those of you who are prone to overthinking.. where does your peace of mind come from? how did you learn/practice the skills needed to.... silence that voice in your head? i'm not even really sure how to word this.thanks for listening.Read more",
        "comments": [
            "I just started to get used to not giving a fuck and coming to terms with the fact that something might go wrong. If it ever gets to my head I just joke about it",
            "Music has really helped me calm down, or just having something to distract you in your downtime. I also learned to not give a fuck anymore, most of the time it isnt worth the overthinking.",
            "Meditate. I couldn't recommend Calm enough. Meditation completely changed my life and taught me how to quiet my mind. Remember it's called practice for a reason and being bad at it is part of benefitting from it as you change how you speak to yourself. Hope you find peace friend.",
            "I want to take a moment and thank everyone for their input. Reading through all the suggestions on this thread gives me a little more hope that we can all eventually conquer our struggles with overthinking! cheers everyone!!",
            "Finally something i feel identified. For me, the way to srop overthinking is to find a distraction like videogames or music, i imagine how much things i could have done if i havent overthinked. I tend to overthink EVERYTHING, even the dumbest thing i start to think about it.",
            "It feels like my brain is constantly running this Never ending marathon, and i hate it when people down play it",
            "As my username implies, i am an overthinker. I guess the thing that I find the most helpful is to take a step back and look at the situation completely logically. When you do this you might start to realize how insignificant some of the things we think about really are. Overthinking is a difficult thing to deal with at times, but I have found the most helpful thing is to just look at a specific situation and ask myself, “Will this matter 5 years from now?” That is how you determine what is really worth your thoughts and worries. Hope this helps :)",
            "Get you as many activities as u can,things u love or aspire to become,work on them and keep your mind active and focused on things u can control.shut out the rest of the world. Another thing is giving those thoughts space or assigning them a time during the day or week however u want it,MEDITATE on them and RESOLVE or give yoself a time when its safe to overthink i like using that energy when running or working out (MAKE IT WORK FOR YOU)so i can fully exhaust myself while training and making me better at the same time.WEED...coz its more private and done alone,alcohol didnt work on me coz it attracted more people around me thus more voices added to mine i needed the quite and high state of mind where i can only find me",
            "Exercise is definitely an excellent way to quell the thoughts. When you challenge yourself physically (and I mean truly challenge) you have much less energy to spend on overthinking.  And it becomes easier to sleep too. Also,  it boosts your self esteem so it truly is a win win win. If you're able to exercise outdoors you can add the healing properties of nature to the mix. Speaking of challenging yourself- I've found any sort  of challenge can help get you out of your head.  And,  again,  has multiple benefits.  In my past,  I've used marijuana,  alcohol and other drugs to help me with my overthinking-- for me,  looking back,  those solutions caused me far more problems than they solved. But I remember the overthinking was at times so painful and paralyzing that I would have done anything to make it stop.  If you find yourself overthinking in social situations it's best to try and focus on other people.  Ask questions,  listen to answers-- sometimes helping others can help as well.  If you find the overthinking problem for you is too great therapy can really help (if you're able to find the right therapist). I, personally,  would avoid psychiatric help (like antidepressants and other rxs) until you've tried as many other options add you can.  It's not easy and these are all just suggestions.  I hope you find something that helps among your responses here.  Im sure you are not alone in this and glad you asked a question that can help others too."
        ]
    },
    "whats_the_definition_of_peace_for_you": {
        "title": "What's the definition of Peace for you ? : r/RandomThoughts",
        "text_body": "Explain what is peace to you.Read more",
        "comments": [
            "Moderator AnnouncementRead More »If this submission above is not a random thought, please report it.Explore a new world of random thoughts on ourdiscord server! Express yourself with your favorite quotes, positive vibes, and anything else you can think of!I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns.",
            "Not having to think aboutpeaceis what definespeacefor me.",
            "Persistent simplicity.",
            "When My body is relaxed and I dont have a million thoughts",
            "adhd : challenge impossible",
            "No one needs anything from me work wise, home life or extra curriculars. I can do whatever I please that day.",
            "Ironically it's fighting. During a match the gajillion thoughts fluttering about my brain space disappear, leaving this quiet simplicity of only what/who is front of me. I've come to call it my hulk brain. Thoughts are more or less comprised entirely of monosyllabic statements like “that hurt, must stop hurt.” The rest is a silence that is indescribably beautiful.",
            "Inner contentment.",
            "No one bothering fur anything and being in an environment I am content with at least",
            "Freedom from fear, retribution, and judgment."
        ]
    },
    "whats_the_secret_to_living_a_peaceful_satisfied": {
        "title": "Whats the secret to living a peaceful, satisfied life? : r/AskOldPeople",
        "text_body": "No text body found",
        "comments": [
            "Moderator AnnouncementRead More »Please do not comment directly to this post unless you are Gen X or older (born 1980 or before).  Seethis post, the rules, and the sidebar for details.  Thank you for your submission, darragh1245.I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns.",
            "Keeping the drama queens, attention seekers, time vampires, narcissists, machiavellians and  histrionic types out of your life. Surround yourself with people who care and matter.Don't watch the news.",
            "Happiness research says that personal relationships correlate to happiness more than any others. Build barriers with people who bring you down or cut them out of your life and do what you can to sustain good relationships.",
            "Living within your means. It gives you choices at times when other people may not have choices.",
            "Stop people pleasing and live authentically",
            "Take care of your health, mentally and physically. Get outside, even if it means bundling up and wearing waterproof shoes. When you're outside, do a walking meditation, breathe deeply, take in your surroundings, clear your head. Learn to set boundaries for negative people. Eat well, less processed food the better Try to connect with people who bring you joy, even if it's not in person. Find a hobby or a way to spend your time that is fulfilling. None of this is easy, especially if you're already in a hole, but it is worth the work",
            "“Do not spoil what you have by desiring what you have not; remember that what you now have was once among the things you only hoped for.”  ― Epicurus",
            "Peaceful- stay away from violence and people that will cause it.Satisfied- have a realistic idea what you really want and need out of life.Surround yourself with people you are always glad to see.Read, walk , thinkWhen you can, do something for others",
            "Trying to figure out what's important to get upset about, you know the old phrase, “don't sweat the small stuff (and it's all small stuff)”? I know it's notALLsmall stuff, but shaking your fist at the clouds kind of stuff, small stuff that sends you spiraling and complaining all the time or being bitter and blaming everyone, comparing everything, judging people, feeling like the victim, that doesn't help. The anger for really short term stuff or daily annoyances, worrying leads to anxiety and manifesting anxiety like taking it out on yourself or others, and just nonstop complaining, it doesn't solve problems at all. They're emotions.And it makes you miss the small joys to appreciate. The things to be grateful for. Like if you see something kind of nice, you notice it and it's good but you ruin that moment by worrying about something else, or comparing it to something you hate, especially when someone says it out loud and ruins another person's mood in the process.So say you saw a neat cloud and say oh no it's probably going to rain, or a bird and it's probably going to poop on my car, and suddenly that cloud isn't going to rain because of course you'll have to clean the poop off your car yourself, but they don't go back to appreciate what a neat cloud, what an interesting bird, etc.So don't be like that."
        ]
    },
    "what_brings_you_peace_in_life": {
        "title": "What brings you peace in life? : r/infj",
        "text_body": "Honestly just writing this to remind myself on the things that matter in life — I've been feeling a bit aimless lately despite life going relatively well so I've been collecting people's responses on the question^in hopes of inspiration lol.For me it's mostly little things like drinking with my friends at a bar on Friday nights, or reading on my iPad at coffee shops. Listening to classical music at night in complete silence, looking at the cityscape/nature from somewhere high up. Traveling and long train/airplane rides. The feeling of intimacy from connecting deeply with someone. Just being in the presence of someone you love. Idk HAHA. Little things but they somehow mean so much. Strange huh?Read more",
        "comments": [
            "Two things.-Middle of nowhere in nature.-Middle of nowhere at an abandoned place.Or in other words; as far away from humanity as possible.",
            "“If more of us valued food and cheer and song above hoarded gold, it would be a merrier world.”On god, I'm a freaking hobbit.Peace is found in a hot cup of lapsang or chai, in fresh baked bread, in super fuzzy warm blankets, and in the garden. It's in finishing another book because I couldn't stop myself, or in completing another watercolor notebook. It's in practicing my French or Arabic badly with my cat. In the warmth of my partner's chest after a really really long day.It's the small things. Yeah.",
            "This just reminded me that I need to get my weekly chai fix (and ur hobbit-ness is much appreciated, my user is literally hermit related lmao)",
            "I am also a hobbit.",
            "Feeling safe. Like, in my bed with my dogs, weed and some music",
            "connecting on a deep level, people who are like oxygen, openminded with no ulterior motives ( excluding those who are ulterior without motivesconfused), caring scientific  people who think outside of the box but with receipts,f a a a a routside the box, when you travel to the sea and that first noticing the sea air, noticing animal consciousness, and their humor, baby hippos, baby donkeys, well, all donkeys, inclusion of those who feel like outsiders, seeing the scruffy man shocked that one would ask him for help, that one even notices him, non verbal communication that thingies a great sense of energy,good energy, when you notice things you somehow forgot to pay attention to, like a deeply starry blueblack night, or the birds hopping from old architecture roof to roof, with the light being tinkly silver yellow pink ...",
            "My cat and also my fantasy land wondering what true love is like",
            "Running outdoors and hiking. Running especially clears up my mind and lets me plan out what I need to do for the day.Being with friends is great but I find that working out alone is me time I need on a daily basis.",
            "Being with a group of people you love, spending time and knowing they're okay.",
            "I am drawn to anything hygge. I love eating a satisfying meal while watching a cozy movie. I like a peppermint tea or a coffee. Cuddling up under a warm blanket on a cold morning with my baby and/or husband. Taking a walk through crunchy leaves or going for a road trip. I love to write and to read, and occasionally I dabble in watercolor. Any creative expression, really. I enjoy cooking and baking when I have the time. I like to garden and once upon a time I had chickens and goats— hopefully one day I'll get back to that. Also, oddly enough, I find it really comforting to go to ikea lol.Overall I believe that slowing down is important for all of us. We weren't meant to live such fast paced lives. Decluttering has also been very important for me. Less genuinely is more in life. It leaves more space for the things that matter."
        ]
    },
    "what_brings_you_the_most_mental_peace": {
        "title": "What brings you the most mental peace?  : r/Journaling",
        "text_body": "Is it a person ? A place ? ...is it an activity you do ? Is Journaling the only hobby bringing you mental peace ? What's the most impact something has on you- how does it work for you ?Read more",
        "comments": [
            "For me it's nature. Something I can always fall back on in times of sorrow and it will (hopefully) always be there.",
            "Beautiful 😍  and true ;)",
            "Going out with friends. I haven't had friends to hang out with in a while and I've been meeting up with friends recently. It's honestly been really nice to get away from my other responsibilities for a while.",
            "I completely sumpathise <3 I'm glad you found people to relax a bit with <3 🫂",
            "Recently it's just lying quietly in my boyfriend's arms (after a lifetime of toxic relationships, I am finally with someone nice and caring. Feels totally unreal!) - my mind is at perfect peace.Also: writing. It's been something that brings me peace since I was 13. Be it a journal or a fanfic or some story I would write in countless notebooks. Journaling is like therapy, but less expensive 😅Recently I also found that exercise can bring peace. I think it's the endorphins that are released during exercise that help. Again, this is after a lifetime of avoiding physical exercises like a plague.",
            "This will be a weird one... but the way the light hits on a sunday at 10 to 11 am, I don't know why but it reminds me when I was a kid and my whole family gathered for a Sunday meal almost every week and I had no worries besides my crayons getting lost... damn man miss those days",
            "Not weird at all- I'm up early most days bc I like the way the first light of the day feels <3 ❤️ relatable for sure <3",
            "Talking to someone helps. a lot.",
            "Sometimes I take my headphone put my phone on airplane mode and hit shuffle I have about 60k songs on my phone so laying on the floor and letting it ride.... If I really want to razzle dazzle (lol) I'll light a candle or throw on one of the game systems.",
            "I love lying low in grass on a sunny day and pretending I'm a mouse. From below the plants look like trees and the meadow becomes a forest, an entirely new world. For a moment I become very small and i can watch other small creatures/bugs that hide under the plants. When wind blows, the whole world around me moves. In this constant motion of grass I find stillness of mind."
        ]
    },
    "what_is_the_key_to_having_lasting_inner_peace": {
        "title": "What is the key to having lasting inner peace? : r/productivity",
        "text_body": "Inner peace is something that we all desire, but it can be difficult to find. There are so many things in this world that can throw us off balance–work, family, money, etc. But the key to having lasting inner peace is finding a source of stability that doesn't rely on external factors.For me, that source of stability is my job. I know that may sound strange, but my job is the one thing in my life that I can always count on. It's something that is always there for me, no matter what. And that sense of stability gives me a sense of peace that nothing else can.What is your source of stability? Is it your job, your family, your friends? Once you identify what that is, you can work on building a sense of inner peace around it. And trust me, it's worth the effort.Read more",
        "comments": [
            "Take what I say with a grain of salt because this is a daily struggle.You have to be content within your own mind and with yourself. Your friends, job, loved ones can and will leave eventually. Once your happy within, it will trickle out.Try journaling and write out things bring you peace and control.Lastly, any type of envious mentality or behavior is ultimately going to hinder you. If you are carrying past trauma you need to work through it and forgive whoever it is. No I'm not saying forgive as in have a relationship with them but if they did something despite you they are the only ones winning within your head.",
            "Trama can be other things too like a car crash. You will carry trama you have like a huge rock till you deal with it. If you can get therapy. It has been worth it to me.Also, a root of suffering is comparison.",
            "You can only control what is under your immediate control. Don't stress or be anxious about things that are not within your control",
            "I think it speaks for itself. It's called inner peace because it comes from the self. Accept that there is nothing within your control in this world other than yourself, your perception, your emotions, your actions.",
            "I suggest you to read Eckhart Tolle's books. Everything in our life has ups and downs and it is normal. Even the richest, most lucky guy has issues in his life.  The only thing that can give us lasting inner peace is accepting that life is sometimes good sometimes shit. Also not thinking about past and future but enjoying the moment.",
            "Create a high quality of life.I enjoy the lifebook programTake each category of your life, ask deep questions about where you are currently and where you want to be in each category, then set goals for each.Main categories include : health and fitness, career, income, friendships, social life, intellectual life, emotions, quality of life, life vision, relationship, parenting etc",
            "Just don't put too much of your worth in your job. You're only one health issue or one manager change away from losing it. (Happy inner peace!)",
            "What a big question! I would say true inner peace comes from belief in a higher power and purpose. Then radical acceptance of oneself, and relinquishment of the need to control everything around you. Improve what you can and do all things with love and charity toward others, this is a good way to begin upon a path to inner peace.",
            "Contentment and not letting most things bother or get to you. Accepting that shit happens, just keep swimming and all that. You can control how you react to the external but you can't control the external.",
            "Minimalism and the practice of Stoicism."
        ]
    },
    "what_is_your_trick_for_maintaining_inner_peace_in": {
        "title": "What is your trick for maintaining inner peace in a (seemingly?) violent world? : r/Meditation",
        "text_body": "Most of the time, I'm a calm, peaceful man. Yet lately I find myself really triggered when reading news about \"people\" (I even struggle to think about them as human beings) who commit the worst crimes like gang rapes (I'm a man, BTW). I find myself dreaming about hunting down those monsters or at least witnessing their execution... My mind just can't comprehend how can anyone be so utterly cruel and cowardly towards women, children, people who can't defend themselves or even animals - and sometimes I just wish a violent death upon everyone who destroys someone else's life just \"for fun\". The fact that it seems like this kind of extreme violence is on the rise worldwide yet these criminals often get away with ridiculously short prison time even when caught doesn't help either...Anyway, this way of thinking scares me about myself as I'm aware that filling my mind with these thoughts only does harm to myself as it costs me energy and focus, it makes me feel very tense and uptight and I also believe in the \"hatred breeds hatred\" philosophy - so I know there's actually no such thing as \"justified murder\".Just for some context - I usually try to stay away from \"news\" altogether as I'm fully aware that most of them serve no other purpose than spreading fear, misery and propaganda (I don't even have a TV). Similarly, I typically avoid horror movies (or any movies with too much gore/violence). Same with video games... I just try to not feed my mind with excesivelly violent stories/images - but sometimes it's really hard as there are some great movies/series with really disturbing scenes (which are important for the story). And some of the worst pieces of news will always slip and get to me, no matter how hard I try to look the other way.So, how do you guys come to terms with the state of the world (and mankind) without succumbing to misantrophy and/or dreams of vengeance?Read more",
        "comments": [
            "A mentor shared a fundamental rule of life. People who are hurt, hurt people. There is nothing more to it. Or at least I couldn't find anything within to learn why this happens.Animals do this, too. You could have the most loving & loyal dog; however, if they are in immense pain, they will hurt you. It's not personal. It's just how it is.Bad shit happens in life but keep in mind the media doesn't generate as much engagement by publicizing the good in society. We are drawn to violence and drama. We are curious, so our attention gravitates to the stuff. We are fed what we eat.Suppose you want to find inner peace. Limit your time in the news or if your job doesn't permit it. Go outside (there is more), look at the people and find beauty in what they do. For instance, it brings me joy to see people admire the sunset or last year, I saw a woman take a picture of a goose. I felt the pleasure she had in the moment just by observing.P.S. The more negative stuff you see and watch, the algorithm will take note and provide you more. Don't use the confirmation bias. “What is see is what must be true”",
            "Seeing pictures of animal abuse, over and over, trying to make a FB Page, and similar educational Sites hoping that those who love animals could be more informed and spread the word to others who cherish animals. Ok?Over time, my mental State of mind became obsessed and I started to feel so much Anger about the abusers, I developed deep Depression, viewing others as suspect, I was overwhelmed, deeply distraught, after over a year, I closed down these accounts, whole purpose was to find like-minded folks to meeting and exchange useful Information.Good intentions- I had becoming very, vey angry! I know something Was wrong when I started sending clips, with pictures to frieinds to my FB buddies. Boy, was I wrong, Not why I tried to convence others to the Many wrongs against so many unsolved, unresolved terribly cruel treatment of animals the world over.I can't fight the world, or those choosing to mistreat or kill a poor defenceless animal, behind closed door.I still of course, defend all animals, in all ways possibly. Photos of any and all cases of animal abusers can't stop the sick people who do this, but I had to take quite a breather and find my own Peace. I can only help if im able to maintain a level head.Very challenging.",
            "im beginning to realize that social media is a worse purveyor or fear and misinformation than tv news.did you know the crime rate in the US has been falling since 1980?also, dehumanization is the first step to doing any of those awful things. you should worry about yourself if you're constantly thinking of doing some \"righteous violence\" to some \"subhumans\". you are in danger of becoming the provlem",
            "dehumanization is the first step to doing any of those awful things. you should worry about yourself if you're constantly thinking of doing some \"righteous violence\" to some \"subhumans\"I know, that's why I dislike when I tend to think about someone in this manner. But I definitely don't have these thoughts \"constantly\" - more like couple times a month I guess. And don't worry, I'm too much of a pacifist to act on any of this... :)As for social media, I've already answered that in another post - you're probably right about their general role in twisting the image of the world for most people but my feed is 90 % wildlife photos and some (generally positive) posts from a few close friends / family members so that's not really an issue for me.",
            "I was thinking similar just yesterday. I like to think of myself as a non violent person who cares for all living creatures. Sure I can argue to hell and back with someone but I wouldn't physically hurt them. Until I had the realisation that if faced with someone conducting child or animal abuse, I would definitely become murderous.Recently I read something that prompted this realisation. It was the thought that any human is a product of their environment. So every human could become something very different depending on how they grew up or the situations they were in. This means just about everyone has a situation in which they would kill. There's no escaping it, so make friends with it. What's yours? How can this help you understand the situations of other people who cause harm? How can this acceptance of your own violent nature help you understand others?",
            "Less news, social media and more taking care of yourself and your life. Actually care only about people you know personally. Don't try to save the whole world.Also, it's okay to be bored sometimes, you don't have to be entertained every single minute of your day.",
            "Your desire for violence against them is your door to the next teaching. Your mind contains the violence, and you carry the potential of such violence, that they carry out. Your reactive mind is what you can heal. After years I've settled in a state of “arrest them but try to build a world that can rehabilitate them and prevents violence like this from happening”. Wishing death upon them actually fuels their fires in the end",
            "not sure I have any easy answers for you but I'll leave you with this quote: \"To be angry is easy. But to be angry with the right man at the right time and in the right manner, that is not easy.\"",
            "That \"voice\" that drives you for revenge, drives them for the same way. Just replace revenge with lust, anger, embarresement etc.Once you spiritually *see* that you are exactly the same, you wont judge them or yourself anymore.",
            "Stop reading the news. The news literally looks for the  worst stories to initiate anger inside of you. If you keep reading and listening to things that make you angry then you're going to be angry if you read and listen to things that make you depressed then you're going to be depressed if you read and listen to things that make you happy then you'll be happy.Bad s*** happens and that's life but how much of it actually happens to you. You see they are scouring the world looking for the scariest most triggering information they can find.By the way you don't have to stop watching entirely just realize that's not indicative of real life. Just a scary movies aren't scary when you realize they're fiction realize the news is the same way. Though it is reality it's highly manipulated reality through a very negative filter."
        ]
    },


    "are_there_any_life_hacks_for_when_u_r_extremely": {
        "title": "Are there any life hacks for when u r extremely stressed? : r/lifehacks",
        "text_body": "I am facing life situations that are very stressful and the stress is really killing  I don't wanna reveal my situation here but something if it could help ?Edit please no illegal shitRead more",
        "comments": [
            "Google “4-7-8 breathing” - I've found this simple exercise to be very effective in calming down in about a minute when I'm on the borderline of a panic attack.",
            "Eating a couple of super sour candies during an anxiety attack can distract your brain long enough to allow you to slow your breathing and start counting. This has made a huge difference for me.",
            "There's also something called a physiological sigh.  It's basically a large inhale, a short inhale, followed by an exhale.",
            "Yep. I know a similar one called \"Box breathing\"",
            "400mg of magnesium glycinate a couple hours before bed is super relaxing, relieves anxiety, and helps you sleep. (And it's really good for you.) A good night's sleep gives you the power to deal with stressors during the day.Then, in the morning, I'll take 100mg of L-theanine with my coffee for clean energy without jitters. The l-theanine is also calming but doesn't make you tired. I have sworn by both of these for more than a decade now.Finally,the 4-7-8 breath. I though this was ridiculous at first but I swear to you it works and only gets better the more you do it.Good luck to you. Sorry about all the stress.",
            "Seriously, this is gonna sound lame but these are some foundational pieces that are boring but effective - not hacks, just shit we know works pretty wellgo for a walk outsidelight exercise/movement (avoid high intensity)get hydratedaggressively defend a consistent sleep routineeat nutritious foodbreath work, this can help you control the bodies fight/flight response and shift towards rest/digesttalk with a professionalmeet/spend time with friends (social support)control the controllable, focus on daily actionable items that are within your controlmeditate / interoceptionset boundaries, say no to things that don't align with your personal values",
            "Literally this. I took this week off because of intense burnout at work. I did nothing productive. I slept, watched TV, read books, and ate food. That's all. Yesterday, I went to “commune with nature,” as I like to say, and it is the most calm and healed I have felt in the long time. I live in Oregon, so I went to the coast to my favorite pull off site where my dog loves to run around, and I just laid on the beach on a blanket for a while. Then we did a little hike to the Giant Spruce, and I stayed there and laid down for at least an hour, hour and a half. Wrote in my journal. Rested and recharged. Idk why the Spruce is my comfort place, but it is. There's something about being next to a tree that's been around for 550 years that just makes you feel grounded. Nature is a healing entity. It's not a substitute for therapy and medication and other self care, but to me, it's an integral part of it. As the kids like to say, go touch some grass. But really — go barefoot, and touch some grass. You'll be surprised by how much better you feel.",
            "Great suggestions here. I'm fighting cancer and during this treatment the main goal for me is to maintain a positive attitude: I'm on treatments that are linked to depression and suicidal thoughts. So far, have kept the wolves at bay with:exercise. Every day. Doesn't have to be brutal but definitely has to have an overall larger plan (you could ask ChatGPT for a long term program). Really helps with general fatigue, sleep, positivity.sun exposure. Sun, lamp, whatever.proper nutrition: nothing crazy, just supporting the exercise and general health.sleep! Maybe should be #2. Use a sleep tracker and make sure you're getting enough quality sleep.positive interactions with people.I'm also trying grounding, cold showers, various supplements, about to try self- hypnosis.proper use of caffeineelimination of negative inputs— used to be a big political podcast guy. Cut way back.projects. ChatGPT has been fantastic for me. First to help folks at work integrate it into their routines, second for helping me learn (currently languages), third, it's really polite and positive (see #5, even through it's not a person)!structured breathing and therapeutic sighing.Look at Andrew Huberman's podcast… he has lots of ideas about how to improve physical and mental health.Also,I can't vouch that all the activities above work— but I feel emotionally great (against all odds), and even placebo effect can be really helpful! I feel like if I throw all available tools at the problem, if nothing else I won't get on myself for not doing enough.Good luck.Edit: on the other side, don't get down on yourself if you don't do all the above! I have the luxury of working half time, and am ok financially, so it's way easier for me to find time to work out, nap, do projects, buy supplements, buy sun lamp,etc etc than most people. But most of those are low-cost (time and $) interventions. And exercise is time-intensive but I think it has outsized positive effects on fatigue and stress.",
            "Grounding.And breaking challenges into small parts - you can't do everything immediately - just pick one thing you can address right now.",
            "Look at nature. Even your backyard. Google the science behind this.Edit: I don't know who taught me this or when, but touching cold water to the insides of the wrists and elbows does something to cool and calm the body. Better than a hose full of water somehow."
        ]
    },
    "coping_with_the_fact_that_you_caused_significant": {
        "title": "Coping with the fact that you caused significant trauma on others? : r/CPTSD",
        "text_body": "The cycle of trauma is a vicious cycle and before working on healing we tend to not make the best decisions. The same pain and trauma that you went through is something you passed onto someone else and it hurts to think about. You try to be a better person from here on out but you still have to live with what you did. We've all done things we're not proud of but how do you cope with being the villain in someone else's story?Read more",
        "comments": [
            "I acknowledge my capacity for cruelty so I can hold myself accountable for choosing better behaviors moving forward. I can't change the past, all I can do is make better choices in the present and future.",
            "I feel basically the same way. I understand that at the time, I was behaving like a caged animal because that's how I felt. I can only control, hopefully, what  I do now. And I am open to apologies, should the situation present itself.But these days as, I'm more aware- I just try to do different.",
            "This is basically my marriage.I had a traumatic childhood but didn't recognize it as traumatic for many years. I got married and tried to fit myself into all the \"normal\" life boxes and had no insight into the fact that my trauma history was a huge driving force in my life throughout all of that.In that time, I was cruel and hurtful to my husband. I projected my lack of safety, fears and anger that came from my childhood on to him in some of the very same patterns that abuse had been given to me. I had no idea that's what I was doing and it took him almost leaving me for me to figure it out.Things really came to a head about a year ago and I've been on a hell of a personal journey since then. I can't go back and fix the pain I've caused my husband but I can take responsibility for my actions and I can make changes going forward. I cannot even begin to explain how much safer, happier, and healthier my marriage is today because I started to actually face the trauma in my past. My husband has been clear with me that he absolutely wants to forgive me for struggling so much with such a shitty card I was delt  -- but that I also need to learn to forgive myself. I'm still trying to figure out what that whole self forgiveness thing looks like, because I don't know. I just know that I have control over my choices today and that the choices I make in this moment will impact my future. And I want my choices to be consistent with my values and beliefs and goals, not with my trauma and fears and history.",
            "I can relate. I've said so many things that I can't take back, and I'm just so glad he's stuck around leaving space to bounce back. 🫂",
            "I am commenting because I feel like I'm in a similar situation. I believe what I did was just trying to process what was done to me, but that doesn't make it any better. At the moment I don't have a good way of coping with it, I just wanted to say you aren't alone",
            "Understanding although what happened cannot be changed, the present still continues. It is always possible to do right without catastrophising and escaping to future or past. Sometimes even with the same people whom you hurt.I use flight response (diagnosed as adhd) and I actually realised how trauma affects, my life and the lives of my loved ones, through the hurt I caused to someone who I believed to be very important to me. I ran away from the person and left them alone because I couldn't deal with the shame of doing something that wrong. I didn't even realise me being there to support was an option. I wanted to die, suffer, disappear.Turns out there are more to people's feelings than constantly reading the room. I was not aware I could ask, I was afraid of learning. I was afraid of peoples feelings invalidating me, so I tortured myself for every possibility of me doing anything wrong. I thought that was taking responsibility.I am healing myself despite hating myself so I stop hurting people. I am trying to realise I am \"people\" too. I give an infinite amount of \"compassion\" to people which I came to accept as self serving and insincere. Still, I cannot even give that fake compassion to myself.I realised trauma limited my ability to empathize with others. How I only prioritised avoiding my fears and how I was abandoning others and myself in the process. I am a very self concerned person(see how I'm still talking about myself) because I deeply believe people will always hurt me and they would be better without me. I had to learn I was not ineffective, my passive avoidance, my resentment, my insecurity were affecting my ability to form intimacy and hurt people. I was starved for love, the love I could never ask for but grow resentful for never receiving it. Honestly I wouldn't recognise it if it hit me in the face. I am the worst person in the world and the most entitled person at the same time.I understood why I couldn't face it all this time, it hurt like hell.",
            "I was super traumatized and unaware when I was dating in university. I cringe looking back at how naively selfish, emotionally numb, and flighty I was. I hurt a lot of good men. I rejected tons of them because of my unconscious fears. I can't go back and apologize to them because I don't know most of them, but I can act better now. I also counsel the young women in my life to be kind to men while dating. I was operating on faulty programming and forgive myself for that, though it's tough. You know better, you do better.",
            "You've done the hardest part: accepted responsibility for your actions.The way I've learned to cope and keep working on it is by thinking of it like this:It's like being a drug addict or alcoholic. And now I'm trying to stay sober. I would relapse a lot and hard in the beginning. It would make me despair that I wouldn't be able to stay sober, so to speak. However, as time has progressed and I've continued to work on this 'sobriety', those 'relapses' become less and not as hard.I'm still learning to ride the waves of this affliction and I've realized that it's going to be a struggle for the rest of my life, and I've made peace with that. I hope you can find peace as well.",
            "Apologize directly where you can even if it's scary. Accept not being forgiven. Hold yourself accountable by not repeating toxic behaviors and continue to call out the behavior of other abusers. Forgive yourself. You can't change the past. You can only choose to do better going forward.",
            "I'm very concerned I have caused distress or trauma to my loved ones. I try to remember it is not my fault I was poorly. I also seek out and accept and help or support for my family."
        ]
    },
    "discussion_adults_how_do_you_deal_with_continous": {
        "title": "[Discussion] Adults, how do you deal with continous stress and anxiety : r/GetMotivated",
        "text_body": "So I am in my early 20s, and due to a housing crisis in the city that I am studying in, I will be homeless in less than a week, and the situation seems worse day after day. I spend every waking hour either finding a home online and once I have searched through every single website I fall in a state of anxiety and stress, knowing that I have spent lots of money paying for services to find a home, and will be occurring even more expenses for hotels/ airbnbs for at least the first week of August.I also have 1 more year to graduate, and I know how the job market is, so I am trying to learn as much as possible to put on my resume. Adding on top of that I have a martial arts competition coming up at the end of this year, and I have not been training for 3 weeks due to this housing situation. At least I still have time to maintain my diet, but other than that not much else.How do you adults do it? With jobs, family and your hobbies, what do you do to deal with times like this? It is summer so I don't have school, and without family responsibilities, but I find myself just unable to do anything because I am just waiting for my phone to ring from a potential landlord.Read more",
        "comments": [
            "Have a clear head, don't do drink,drugs,it will make the situation worse,exercise,keep going don't give up,good luck",
            "Bam. I'd also add to get plenty of sleep. Prioritize GOOD sleep over mostly anything else.",
            "Pretend like someone else is panicking. They can make better decisions if you keep your cool. You alleviate the outcome by staying rational.",
            "It's pretty easy. I'm very optimistic most of the time. I don't create scripts of what would/will happen. If something bad happens then I think about it at the moment.",
            "I've added 4 things to my life this year that have put me in a much better place.Reading is a good way to get myself off of social media at night. Libraries are free (and fucking awesome).Hiking + photography gets me out of the house on the weekend and in nature. My dad gave me my camera but you can get the same set up for $150 bucks and get surprisingly amazing photographs. Photography YouTube videos have replaced more useless social media and doom scrolling.At least 5k steps a day ensures I get some activity and makes me feel better both physically and mentally.A light workout each day (100 sit ups, 60 dumbbell curls, 60 dumbbell bench press reps) makes me feel like I'm working towards something (I won't get swoll but it'll add slightly to my dad strength).I've lessened how much I drink (no hangovers, more spending money for other things) and often replace it entirely with THC gummies. Different feeling but enjoyable and no hangover",
            "There is really no secret, you just gotta wake up and do everything and hope nothing else will go wrong",
            "Embrace it… eat well and exercise plenty",
            "First rule, don't panic. Next, you mentioned you are waiting for landlords to call you. To be blunt I believe this is around the wrong way. Get on the phone, start calling them first, like pick up and dial the number do not simply message them, but do send a message straight after you have tried to call them, then keep calling back on the hour. Be annoying as fuck about it nobody honestly cares about you as much as you might want to believe. It's about your priorities. Subordinate everything else. Stop worrying about whether you're going to be homeless and take as much action as you can while you are not homeless. Seriously get after it and leverage absolutely any amount of network you have. Start conversations with people you meet during the day. You will be amazed how many opportunities you are walking past.",
            "Get a hostel! That can cover you until you find a place.",
            "I am a Tai Chi practitioner. Please do some QiGong. The breathing and circulation truly helps in so many ways. Then do your partial art and practice practice. It's good for your physical and mental health. Not practicing is self sabotaging. It will create more problems. Please, please take care of your physical health. Eat, sleep and take a  short nap every day and have some fun, enjoy yourself, look at comedies or memes or something. And most of all be stubbornly hopeful You can do it! My motto: If you have a lemon, make lemonade And Never give up!!!!"
        ]
    },
    "has_anyone_managed_to_actually_turn_their_life": {
        "title": "Has anyone managed to actually turn their life around from trauma? : r/CPTSD_NSCommunity",
        "text_body": "Im not talking about banal, superficial stuff like, ocassionally feeling better, having better control of triggers or symptoms, or sleeping slightly better. Or having better day once a month. Or   having flashes of normalcy.I mean being a completely different person. Experiencing no symptoms related to trauma. Being the true you with all that comes with it that you were scared to be or couldnt be before. Being available, open, curious, compassionate. Being able to connect with people and be vulnerable and honest.  Not sometimes, but all the time, as new normal.I mean completely turning life around. Following your dreams that you could not do before due to trauma impairments. Becoming successful, professional, competent and satisfied and accomplished. Starting busienss, changing career path and succeding. From being depressed, suicidal to being filled with life energy, willingness to experience life, discover yourself, do things and enjoy them.And lastly, finally, being fucking happy, calm and peacefull nearly all the time.Am I dreaming or all of this is just a everyday baseline for normal people?I dont think I am.Read more",
        "comments": [
            "I'm still in the trenches with you, but I just thought I'd pop in with a little reminder. There is a good chance that those who are completely recovered and living thier best life aren't on reddit hanging out in a community like this one. So your samples of those who respond might be skewed. Keep dreaming though, I think that's healthy. Maybe pick up some biographies for inspiration.",
            "That's a valid remark. Most people which drop the weight of trauma probably leave all these subs and go living a happy life. It's good there are some folks which stay to provide encouragement with their own recovery story.",
            "I think it is an unreasonably high bar to define being healed as zero trauma symptoms. People don't define healing from depression or eating disorders as \"no bad days\" either, rather being healed is that the symptoms aren't the main driver in their life.I still have occasional flashbacks and bad times, but they're shorter than before, and I spend majority of time in the window of tolerance, peaceful, content, and even happy sometimes.I would consider myself healed in some areas, while other areas are still healing.CPTSD can be literal brain damage. Don't be too hard on yourself.",
            "I think it is an unreasonably high bar to define being healed as zero trauma symptoms. People don't define healing from depression or eating disorders as \"no bad days\" either, rather being healed is that the symptoms aren't the main driver in their life.I agree. All feelings are valid, and even someone devoid of any trauma will feel 'uncomfortable' feelings at one time or another. I define 'healed' as the point where those feelings no longer hold power over you or hold you back from what you want to achieve in your life.",
            "I have 🥰So, for context, I spent the first 34 years of my life being abused by various people. By the time I finally got safe, I was completely unable to function. I went inpatient after a panic attack left me unable to walk. They gave me some meds that thankfully brought my panic down to a dull roar, bit that didn't stop the nightmares, the constant dread or the flashbacks.I went into therapy straight out of the hospital. I did talk therapy, for no other reason than I had no other options. My therapist and I set out a plan for how to tackle my trauma, and we got to work.It took me 3 and a half years to heal. I still vividly remember my first day waking up without fear. I'm now free from symptoms, trauma responses, and all other impacts of my trauma. I know exactly who I am, and I love myself completely.I've learned hobbies, and reengaged with interests from my past that I was never fully able to harness. I just got my first job in over 10 years. And the best part is, I know my boyfriend loves me, and I've learned how to participate in my relationship in a healthy way.I promise healing is possible ❤️❤️❤️",
            "Yes.I grew up in a household with an abusive bipolar father and a neglectful alcoholic mother. I am also ADHD and autistic. I was bullied all throughout school by peers and teachers. For many years, I closed myself off. I became content with being invisible because that was better than being seen.Now I own a meditation sound healing studio where I do my best to serve the collective with an open heart, and with the love of a mother many of us never had.",
            "I have healed to a significant degree. I was abused for over 30 years and went from being highly suicidal for decades to being pretty darn happy. I am a completely different person. I'm learning to connect with people. I've found a community for the first time. Maybe I continue to have trauma responses, idk, but I'm learning a lot in a short amount of time. No job but idk if that will change.",
            "No but I feel myself getting there. I'm slowly surrounding myself with healthy people, getting better at living according to my values, and my mental health is decent. I haven't been suicidal, even passing thoughts, in years. I want to be alive every day.",
            "I'm close. I don't want to dox myself bc my job is specific but i am in a career where I help others with what I struggled through in a way that means the world to me, I own my home, I have good friends who I trust (one of whom the trust is quite recent and was hard fought for me within my mind), and I've been totally functional for 3.5 years, I have a cat after fearing I'd never have one for fear of the pain of their eventual passing, and safe relationships with my remaining family.  I'm actually going through a rough patch mental health wise but even so I'm able to keep going and still find joy.Am I “cured”? Of course not. I personally never will be. And that's okay. I'm still working and will always be working, I think, on myself. But I have comorbid BPD, and the risk of suicide goes way down once I hit 30 which is soon. And I've never attempted. I don't hurt people like my abuser did. I am a good person and I even believe that a lot of the time. I have a good therapist. I'm safe. I have a lot going for me.Pretty good for a kid who the stats say should be dead, a junkie, or in jail ¯_(ツ)_/¯. I'll take it.",
            "Yes, I wrote it about a lot recently. I'm even wrapping up my therapy. Imagine that!I'm not sure if zero symptoms is possible, but when a symptom happens (which isn't too often), it's manageable. I'm also not sure if being calm and happy most of the time is possible, unless you live in a total bubble where everybody caters to you -- shit happens, that's life, and it's good and healthy to be upset when somehing upsetting is happening.Everything else you wrote about I am experiencing 85% of the time. I am really happy with how things turned out for me. As for remaining 15% -- maybe I can get that number up to 90% with some more self-work, but there should be some room for imperfection too, and, well, grumpiness or whatever. Sometimes you just have a bad day, and that's a part of being human too. You can't really banish bad stuff or difficult emotions from your life, that's more spiritual bypassing than healing."
        ]
    },
    "how_does_one_actually_start_to_heal_and_move": {
        "title": "How does one actually start to heal and move forward from trauma? : r/Mindfulness",
        "text_body": "How does one actually start to heal and move forward from trauma?I always hear about healing trauma wounds to better be able to manifest and live happier but where do I start and how exactly do I do that?Do I write it down? Do I pretend it doesn't exist and just think positive? I'm not sure what exactly to do.Read more",
        "comments": [
            "Reflect on them: It's not easy, whether you like it or not, you HAVE to relive them.Write everything down in a journal:  It's like a Dairy/ Biography, it will help you realize and knowledge of the things that you did and why you did it... it helps you find the root cause of why you act that way or how a situation that you went through made you into the person you are today.Talk to a loved one or a therapist about what you went through.Affirmations: You must reprogram your  subconscious mind and change your limited beliefs.Spend time in nature: It soothes your nervous system and helps you escape from a chaotic environment.Self Care / Love: Take care of yourself, begin to fall in love with yourself again.Get yourself Spirituality cleanse: Your body and aura field holds a lot of junk from trauma and bad energy...Give gratitude : Give thanks for what you have and enjoy the present moment 🙏🏼This is what I did when I started to heal from my traumas and started my healing journey back in 2022... it's not going to be easy or be perfect, but trust me, it gets better. I wish someone would have told me about this earlier, as I'm telling you now, Anon... I wish you the best and love on your journey!!!! Good luck !!!!",
            "Try and understand what you have. The best first step is to know what's wrong with you in the first placeDiscipline A mental illness is your mindset. Your mental health is your emotional state (these two things get mistaken as the same a LOT). Something you may often hear if you ever went to therapy, or even a school counselor is “how long have you been feeling this way?” The question is directed to determine if the way you're feeling is starting to become the way you think. It takes about a mouth to be able to determine more accurately, that's usually how long a person needs to think in order for it to safely be concluded you are mentally ill. So “How long have you been feeling this way?” Is “Have you felt this long enough for it to be your mindset and the way you process things?” With that said, your mental illness is your mind set, so making a change- which often requires you willing to actually make that changeContacting a professional/therapy. You can potentially more quickly figure out what's wrong with you, and also make a treatment plan with them. Some people don't like therapy and that's completely respectable, it depends on the person and what best fits them for their individual recovery",
            "Definitely seek help from someone trained in trauma therapy. There's a great book called “The Body Keeps The Score” on this topic. Best of luck to you."
        ]
    },
    "how_does_your_trauma_affect_you_physically": {
        "title": "How does your trauma affect you physically? : r/CPTSD",
        "text_body": "To preface this, I didn't even know this could happen?? I thought trauma affecting you physically only happened with PHYSICAL trauma, but recently I had symptoms very similar to like heart problems. Doctors visits and therapy later told me that it was emotional trauma in my life affecting me physically because I kept ignoring it mentally for so long. Does something similar to this happen to anyone else?Read more",
        "comments": [
            "No comments found"
        ]
    },
    "how_do_single_adults_cope_with_loneliness": {
        "title": "How do single adults cope with loneliness? : r/Adulting",
        "text_body": "I'm 29F, single, no kids, don't live with family. All my friends around me are married or have regular partners. I'm not looking forward to a relationship either, but I crave deep dialogue. I enjoy being alone, but fear being alone.I now use a shared diary to share stories with others and gain understanding. I like this approach. Each person's diary is like a mirror, and reading their stories lets me see myself, lets me know I'm not alone, and makes me feel less alone.Is anyone else in the same situation as me? I'd like to know how you all cope with loneliness.Read more",
        "comments": [
            "Welcome to reddit 😂But seriously yeah it sucks. Try joining a club that serves the greater good? There are many to choose from and one of the big focuses are community and comraderie. Currently most of them are occupied by 60/70+ year Olds, but I would bet that these types of clubs will soon see a big resurgence. I am a member of one and even tho I am the youngest by FAR, I still enjoy it very much. Great thing is many of these types of clubs are CRAVING younger members! Details without getting specific:https://en.wikipedia.org/wiki/Service_clubLoneliness is a huge unspoken epidemic, and is just as unhealthy as smoking a pack of cigarettes per week, no joke. Work actively against it!",
            "Agreed. I've looked into many clubs in my area. I've even been using Meetup to find groups, most of them are occupied by older people. I'm a 26 year old single guy and it's tough trying to meet people around my age. People just don't go out like they used to.",
            "My ma joined an art group when she was 30 and was by far the youngest member.  She's north of 70 now and still one if the youngest members....Not to disparage old folks, though.  I sit on a committe that looks after the local trails and it comprises mostly 70-80 year olds, but those guys are a hoot.",
            "shared diaries??? What is that? I'm curious!",
            "Curious here, also!In middle school, my friends and I kept a notebook that we would pass around and everyone take turns writing and replying in (we all used different colored pens).My best friend and I pass back and forth a couple of each of our journals now and then. We take turns writing entries, responding to prompts, and occasionally replying to each other.",
            "I don't think we're meant to cope. We're meant to take active steps to try and remedy the situation. I personally am trying to become more outgoing and watching my diet a bit more...",
            "I'm in the same situation as you.29F, single, living alone and no single friends. Been single just over a year.I have a little dog which really helps. I struggled with feeling lonely when I first started living alone, but now nearly a year later I'm embracing it and loving being independent and having my own place. There's nothing wrong with being in this position. Though of course I still feel lonely at times.I also find having background noise when I'm at home helps too - a podcast or TV show or music. I try and see friends/family at least once a week and am trying to get back into doing social things like Netball, exercise classes etc. There are social apps such as Meet Up too that you could try if you want to make some new friends.Personally I would rather be single and living alone right now than in a relationship, with kids etc. Life is peaceful and quiet when it's just me and my dog.You're definitely not alone!",
            "There is a difference between loneliness and solitude. I may recommend an adventure. You need a quest! Live in another country and learn a trade or an art, or reinvent yourself. The profound dialogue will come as you immerse in yourself. But have a concept! Don't let boredom and loneliness get you. These are the feeling of sitting in still water. Solitude will help you know yourself.For example, there are several programs in Europe or Australia where you can get a working visa for a year. Heck, you can study in Europe for free if you are an American. Are you not craving for a relationship? Well, go to Argentina or Italy and those guys will change your mind real quick.It's time for you to go!I felt like this when I was a teenager and around your age, so I left, and it was the best decisions ever made. Don't sit there and rot.  Comfort at your age is a trap— it does not build anything. And don't look at your friend's life. I married my wife at 38 and she was36 and by now have two small children. I have already lived in four countries and have plenty of adventures to tell.As a reference to Sting's speech about his father's advice (live in Berlin - why should I cry for you), Go to sea!! I'm rooting for you!",
            "I watched a podcast recently on the epidemic of loneliness in society today. The podcast was hosted by a Buddhist trained monk who went on to become a licensed psychiatrist. He said that individualism has characterized Western society for several decades, particularly in America. While that's not inherently bad, it does mean that we expect people to take the horse by reigns so to speak and solve our problems by ourselves.We run into a stumbling block when faced with loneliness,  however. It is the one challenge that cannot be fixed alone. It requires other people who want to be social and invest in community with others. In a world that's increasingly dependent on social media and interacting online, opportunities to interact with others in person are decreasing today.I am going to look for groups in my area to join, such as church fellowship groups and volunteer opportunities at a local non-profit. I try to remember that I am not alone in my struggle with finding positive, face to face social interaction today.While it doesn't solve the problem, it helps me keep things in perspective and not beat myself up.",
            "Get some other friends who aren't married and who share the same interests as you. My daughter is your age, not married, not interested in it atm.. she lives alone with her cat, but goes out with friends frequently to social events or camping and hiking.She also went back to Grad school to work on her MS."
        ]
    },
    "how_do_you_cope_with_chronic_loneliness": {
        "title": "How do you cope with chronic loneliness? : r/lonely",
        "text_body": "No friends, no relationship. Nobody to bond with or open up with. Just my family. I don't like having no friends and no partner. I just got banned from a discord server (for saying birth control should remain legal), which had my only friends on it. Alone again. I don't want suggestions, I've accepted my loneliness. Just tell me how to cope with the constant emptiness and sadness.Read more",
        "comments": [
            "I distract myself with hobbies",
            "I play online games with VC (even when I don't use mic.) it's still some level of socialization, either listening to people or typing in text chat.",
            "I play games and watch movies while waiting for death",
            "Honestly, I've just accepted it at this point. I've spent every birthday for the past 7 years alone. I only talk to my mom, dad, and sister. They live in another state. I don't have any friends. It doesn't seem anyone is interested in me and I'm a bisexual woman.I don't have any hobbies honestly. I enjoy running, reading, and the occasional video game. I doom scroll social media. Watch porn to fill the loneliness I feel. I've only had one relationship my entire life.I guess the way to deal with it is to accept it or try to reframe it in your mind as an opportunity. If you're alone no one can hurt you except yourself",
            "Ugh I get this completely. I don't have an answer unfortunately bc I usually just smoke my weed & try to forget I'm lonely even if it's only for a few..",
            "i used to play video games. but haven't done that in months. just lay in my bed endlessly scrolling until i die with my cat nearby, she helps.",
            "Spending time with myself and doing or studying things im interested in^",
            "spending time with yourself? isn't that just another way of describing being alone",
            "Hey, I am also a bit lonely since all my friends went to uni and stuff while im sat at home trying to find an apprenticeship, I have discord so if u wanna friend me on that and maybe if you want to join a server Im on that I have made a few online \"friends\" with",
            "don't cope well at all, just worry all the time"
        ]
    },
    "how_do_you_guys_deal_with_loneliness": {
        "title": "How do you guys deal with loneliness? : r/simpleliving",
        "text_body": "Especially when it seems like everyone around you is with other peopleRead more",
        "comments": [
            "I wish I knew. being widowed made me feel the loneliest I've ever felt. now even with people I feel alone because I know nobody gets how I feel. especially because he took his own life, nobody knows how to talk about it so they just don't. if I bring it up they get uncomfortable and change the subject.it's been five years I have another partner but he had to move out to help his mom and I care for my grandparents plus my kids. so we don't get much time together anymore unfortunately.I'm sorry I can't help more. I wish I knew how. I am on antidepressants but I went from like 120lba to 180 in under six months and no matter how hard I try it's so hard to lose it.I will say it's important to remember depression will lie to you. it'll tell you people don't care when they do. that's what my late partner didn't realize. he honestly thought we'd be better off without him but that wasn't true it was the twisted lies from his depression.I'm sorry I'll probably delete this later I guess it's obvious I'm having a hard time.",
            "Yes you are right, depression will 100% lie to you. It almost makes you immune to the love of others",
            "That has to be so hard.  Wish you wouldn't delete so others may benefit from your post, but I understand if you do.  <3My MIL was with her husband for 65 yrs, and 15 yrs later, she is still in mourning.  We are around and visit and call often, but it's just not the same, and you're right, none of us knows how it feels.",
            "Wow. Instead of just changing the subject, has anyone ever continued the conversation and let you speak? Even just one time? I hope someone does that for you. While your situation isn't the easiest to relate to, it doesn't mean that it's alright to just ignore you. I'm so sorry for your loss.If I'm honest, I've never heard of depression described in that manner and yet what you described is exactly how I've felt for a long time. Nearly every time I feel like I want to talk to someone, I stop myself because I feel like it's not worth wasting their time. They could possibly want to hear what I have to say. It's not important enough. So no matter how upset I am, most of the time I just hold it in. If I just can't hold it in anymore, I'll just blurt it all out to my one online friend whose life is even shittier than mine because he knows exactly what I'm talking about. And after that, I feel like it was useless because my life is still shitty regardless. In a way, I wish I could have friends that I don't feel like I have to be reserved with, but I also feel like I'm not worth anyone's time. And inn the rare circumstances that I met someone who actually tris to talk to me often, I don't want to be too open. The last time I did led to the most unfortunate series of events ending in what I could clearly describe as a deep depression. I guess I've been comparing every experience after that to that moment and assuming that I can't be depressed because those situations didn't match that severity.Please don't delete your comment. I think someone other than me needs to read that.",
            "I go to brazilian jiu jitsu practices... as some redditor posted the other day onr/bjj, bjj ticks a lot of boxes:a lot of social interactions in class.the feeling of belonging to a group and being appreciated in it (after a while).human touch (its weird but I think you really build relationships easier in class because of the fact you are physically playing jiu jitsu with each other)exercise (cardio and a bit of strenght)flexibility, mobility and stretchingchallenges/puzzles to overcome.measurable progressa reason to go out of the house when you are feeling down/lazy",
            "Honestly I very rarely feel lonely, the only time that I feel lonely is when I'm with a group of people I have no connection with, which is often forced (colleagues at work, friends of friends at a social occasion...)Personality is probably a big factor in regard to loneliness but I think that self love and enjoying your own comfort are the most important aspects of happiness. Just do the things you like to do in life, all the other things are just extra. Of course having loved ones is an important aspect in life but they shouldn't be an anchor for your happiness.",
            "Yes I think I just need to learn to enjoy my own company more",
            "I honestly feel a lot less alone whenever I prioritize spending time outdoors, by myself or not. I live in the middle of the woods but when I'm outdoors, I feel part of nature.",
            "It takes practice being alone. People who are seldom alone really have no concept of what being alone is like.",
            "I plan on getting a dog... and some chickens 🤷‍♂️"
        ]
    },
    "how_do_you_guys_handle_the_stress_of_college": {
        "title": "how do you guys handle the stress of college/ university? : r/college",
        "text_body": "Lately I've resulted to stress eating and shopping and I don't want that.Read more",
        "comments": [
            "hi! I'm very stressed all the time (taking 19 credit hours) and i have a severe anxiety disorder! I think i'm very qualified in giving advice on healthy ways to handle stress:-assign yourself an end time for doing school work. I don't allow myself to work after 9:30pm unless i HAVE TO. Try and get a healthy balance between work time and personal time-play video games/ do other hobbies. I love video games. I find light games like Stardew Valley and Animal Crossing to be very relaxing and help take my mind off the things i have to do at school. But if you're not into video games, participate in a different hobby!-meditate. Every day as i'm getting ready to relax in bed for the rest of the night I sit up against the wall, perfectly upright, and meditate for 10 minutes. Resets my posture and allows extra tension to melt away. Also try shower meditation. You can visualize the stress washing off your body-exercise! You hear this everywhere. I don't think i need to elaborate-masturbate/have sex.. just not while your roommate is in the room (if you have a roommate)-watch a movie. And i mean a calming movie. Not something that'll spike your blood pressure. Disney and Studio Ghibli both have great movies to watch along those guidelines-read. I didn't start reading as a hobby until college. I love the escapism that books give-chill out with some herbal (non-caffeinated) tea at the end of the night. A perfect way to wind down after a long, stressful day of doing school work-talk to a counselor/therapist! Even if you're not mentally ill, having someone you can talk to about life is so wonderful. You can even talk to friends or family if a counselor is unobtainable atm-try using some essential oils! Lavender is very good for calming the nervous system and might help reduce stress levels… i can't confirm this bc i'm allergic to lavender lolI hope something of these tips helps literally anyone out there! It's just a small list of things that have helped me through this hell of a semester. Just make sure you allow yourself this time to relax and unwind or else you'll never truly help the stress!",
            "Gonna have to skip 5 chief its NNN. Other than that W list",
            "So when school gets me down I tend to eat, watch netflix, procrastinate and go on reddit. However, I think if you want to lower your stress you need to generally lead a healthier lifestyle. Things like sleeping on time, waking up early, eating 3 times a day, sticking to a schedule, etc.",
            "5 minute melt down then back to the homework. But when I'm trying to be healthy about it I go weightlift and if I don't have time or that I take 15 minutes to rest completely, get a snack, and get water then I'm usually good to go. And for me showers are also good resets",
            "I try to keep my weekends free. I'd rather kill myself on a weekday with homework/working than spend 7 days a week working on schoolwork. I also try to do ALL of my schoolwork on campus before I go home for the day. This makes my home a place where I can completely relax and I will not get distracted. Also taking bath, and also eating sweets",
            "exercise",
            "Take things one step at a time. If it looks like there's a billion assignments, I try finishing one at a time and focus on the others later, but I usually try getting stuff all turned the day before the due date (unless it's something really small). And pray and believe that everything will be ok and will always work out.Also having a set schedule with a lot of leeway If possible helps too.",
            "Personally I try to work ahead as much as I can instead of just completing what's due. This helps me stay on top of everything, and if I can't get something done for whatever reason, I have that buffer of having worked ahead. I also try to stop working by a certain time every day, usually that's 10 pm for me. After 10 I'll do something for myself and go to bed, I never do all nighters unless it's absolutely necessary (and I usually don't need to since I work ahead!). This may not work for everyone to reduce stress but it works for me!",
            "I save the weekends for social time. I try to have all or most of my work done by the weekend so I don't have anything to do and can really relax",
            "this definitely doesn't work for everyone but i like the give myself a set schedule for the day! i have pretty bad anxiety and depression that has heightened since i got to college but the schedule has helped me a bit."
        ]
    },
    "how_do_you_handle_stress": {
        "title": "How do you handle stress? : r/developersIndia",
        "text_body": "How to leave work at work? I saw that experienced people leave work at work and care less about work after their working hours.The main stress in IT comes not with the work but outside of the work, thinking about the work outside of work. This is a skill in itself but I cannot do it. What do experienced people do to handle this?Freshers and college students don't answer this please.Read more",
        "comments": [
            "Moderator AnnouncementRead More »Hello! Thanks for submitting tor/developersIndia. This is a reminder that We also have a Discord server where you can share your projects, ask for help or just have a nice chat, level up and unlock server perks!Our Discord ServerI am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns.",
            "Stress never comes from doing the work no matter how hard it is.Stress comes from not doing the work and later thinking about it.So, do consistent progress in the assigned task and once the task is completed you take a small break before submitting.--- told by a corporate mentor..And these statements are validated by a lot of colleagues",
            "In reality, most managers try to pile more work the more you work. So you will be stressed anyway. The solution is to negotiate a delivery schedule which doesn't stress you out.",
            "Set up timelines and follow it consistently. A lot of times, we get stressed on a Sunday night when we remember that we have extra work on Monday because of postponing it the previous week. Make a checklist of your responsibilities and cross them out with the latest updates. Find a hobby that will keep you motivated and busy in your non working hours.",
            "Sometimes I have dreams where I am completing the task that was assigned to me lolTo answer your question, maybe it's time for a job change. Are you being asked to meet unreasonable deadlines and you can't finish it? that can cause you to worry about it after work and on your days off. It really depends on the company and your job security, if you feel valued and are performing at an acceptable pace, added to that a good WLB culture will make it easy for you to leave work at work.",
            "What helped me is- By trying to give proper estimations, suppose if task ideally should take 15 hours, but if you have committed to complete within a day(7-8 hrs work) then the problem starts.- If you get stuck in the technical or requirement understanding speak to your immediate reporter.- Avoid spending more time while helping others.",
            "Not being able to say NO,  is the primary cause of stress.Learn to say no.if something is impossible, say it so.make it clearly known, how much pressure you are under.if your employer cares, it will go low.if nothing changes despite your alarms, find a different org to work for.no one gains anything by working you to the point you break down.",
            "Lol.I like how you have written in the end, freshers and college students don't answer. (I am a fresher btw).",
            "Because this sub is full of students and freshers from the last poll I have seen. There are very few good and real answers. Most freshers have not experienced but they pretend like they are experienced and answer something.",
            "You better enroll in Mental Wellbeing program in your company rather than attempting anything on your own.Benefits.You get help from professional.Your manager and HR gets notification that you are enrolled which implicitly tells that you are stressed because of work, might help in reducing workload."
        ]
    },
    "if_you_struggle_with_loneliness_focus_on_two": {
        "title": "If you struggle with loneliness, focus on two things - hobbies and habits. : r/bangalore",
        "text_body": "I have been reading quite a few posts around this feeling we're all too familiar with: loneliness. As important and sensitive it is to address, please don't fall into the trap of 'meeting new people and dating them' as a cure to your loneliness. You're essentially handing your happiness into someone else's hands, and that leads to many expectations.Friends and romance are important parts to life. But remember how fragile and temporary these things can be.Instead, focus on these two:Hobbies. These are activities that lie closest to your heart. It gives you a sense of direction, purpose and wholeness that no person can fulfil for you. In my short life of 25 years so far, I have tried sketching, photography, music, stand-up comedy, and many other things. Today, music is the closest to my heart and everytime I pickup my instrument, my energy resonates with those around me. And, of course, fulfils me. This helps me set newer goals within my hobbies.Habits. Adding structure to life is something we innately do. Humans have a tendency to balance order and chaos as life happens. Life may be unpredictable, but your routines and moments of self-care will always bring you back to yourself. To your home.Focus on these two areas for a while and tell me how you feel about loneliness.Forcing yourself to do anything is a bad idea (in my humble opinion). Socialising when you don't want to, holding conversations you don't feel like having and meeting people for the sake of it never works. Ask people who have tried this. If you're lucky, maybe (big maybe) you will strike like-minded individuals.However, building yourself up with hobbies and habits designs your character. You're fundamentally asking yourself to be a person of this world - with experiences and knowledge that stay humbly true to you.. . .A little about me: I study Behavioural Sciences, WFH and live alone. Except for a couple of friends and my dear family, I don't have social ties to heavily rely on. Yet, loneliness doesn't push me to chase relationships for the sake of it. The result of it is wonderfully gifted; people just happen. At 25, I managed to find a new buddy. I can't believe how well I connect with him, considering how little I have connected with people who havestayedin the past few years.If you'd like to talk about a thing or two, feel free to reach out.P.S. - Another hot take; Reddit might make you feel worse about your loneliness. The amount of people who areway too comfortablewith their self-esteem and think of the world as a shitty place is darn high. Go, breathe some life into your daily routine and stay away from this platform for a while.Read more",
        "comments": [
            "The age-old proverb, “Sow a thought, you reap an act. Sow an act, you reap a habit. Sow a habit, you reap a character. Sow a character, and you reap a destiny.”",
            "Good one.Philosophies like Taoism and Stoicism helps me look at these daily thoughts in such practical ways. I recently came across this quote, \"Compassion and wisdom will bring the Universe to your favour.\"Being kind to oneself should be a priority.",
            "I think helping others might be one way to tackle loneliness. Like doing some charity work, or joining some self help group etc... Idk just a thought",
            "We can break it down into chunks:You read or hear about something and it inspires you >> this motivates you to look into a value you would like to inculcate >> you turn this into action by being a part of a community.The next thing you realise, these values are part of your habits.Two years ago, I picked up the habit of journaling so I can better communicate my thoughts to anyone who was interested. This got me into a cycle of engaging with different kind of professionals (therapists/counsellors/teachers) and that's how I decided I wanted to pursue something along the lines of Psychology.If charity work comes out of impulse, the innate benefit of it won't really last, don't you think? I'd rather place my bet on inculcating values that lead you to certain places and people.",
            "Nobody is coming to save us. Nothing is gonna change. Keeping this in mind im spending time alone on my hobbies. Did few side projects and ive been going to gym since 2 years. Feels good to have a nice body. But still some nights its really sad, nobody's there to text or talk. No excitement in anything. My old friends some times meet up. They will text 2 days and then nothing till next meet up. I don't remember whens the last time i smiled looking at someones text.",
            "I hope you find someone to have regular conversations with, and more so someone who makes you smile often. Take care and keep developing those great habits.",
            "Same! I can never be thankful enough of all the books, movies and tv shows that have helped me through than any person could ever. It's a big coping mechanism at this point.",
            "Agree to disagree on the Reddit part. I came to see this thread & felt good.You're a good human. IRL, We lose our friends with time. I lost some of my buddies. Some moved on to places. Others broke up(like Beatles? Yes) And it hurts like a rock placed on a warm heart. Part of growing up i guess. Still as you said, the skill, hobbies and our character matters(things that I'm trying to improve n failing lol).",
            "really nice post. completely agree that loneliness should be tackled from within instead of trying to get someone else onboard to fix it for you.also what exactly does one study / learn in behavioral science? i find the brain / logic behind why humans behave the way they do really fascinating. is it related to this?"
        ]
    },
    "i_feel_like_im_dying_of_loneliness": {
        "title": "I feel like I'm dy*ing of loneliness… : r/selfimprovement",
        "text_body": "No text body found",
        "comments": [
            "Feel you…",
            "I felt this. I've been trying to work through similar issues.  I've been in 3 relationships and they all cheated.  I made a decision about 15 months ago to change my life in every possible way. In this time I went from 315lbs to my current 170. I have got my health in order and have even been working on myself in therapy.  I have a few things that I would like get taken care of, and it will. I plan on joining a gym soon to keep this momentum. Working on yourself does work.",
            "You will find that man and have everything you desire once you change your habits. What are you thinking about when you meet a man? Are you aware of how they are? Do you ignore how they are? What are your habits? What type of things do you want from a man? What can you provide? How do you feel when you are alone? In order to get the type of man or woman we desire we have to be our very best version in every way possible. We have to love and cherish ourself. We have to learn boundaries and how to take our time. Sometimes that means saving our energy in the meantime and understanding how to enjoy being alone. Once we create value within ourselve we will be able to see more clear who is and who isn't for us.",
            "So true!! One of the best things I've heard is instead of looking for “the one”, focus on being “the one”!",
            "I want a family and kids and a partner to share my life with. I don't know if I'll ever have that.I am a 30 year old dude that had the worst of luck when it comes to relationships. I met the love of my life with 24, we were together for 4 years but eventually it all went to shit because she was mentally ill and had no professional help so she took it all out on us. I had to leave before one of us got seriously hurt. After trying to pick up the pieces I met another woman and we made it work, living together, having a dog, all the good stuff and then she cheated on me.Long story short, don't make your happiness dependant on others. It is simply not reliable. I am 30 and single, I never wanted to be in this situation. I wanted my life to be something completely different by now - but reality looks different and that is what we have to work with.Work on becoming happy by yourself. I can tell you from experience that you will attract a lot more healthy people for you that way. Just let go of everything, it only pulls you down. You can still have a family someday, but beating yourself up over not having one daily is basically fucking yourself over.The world IS cold and empty unless you fill it with more love. Love you can give yourself.",
            "I think you should sleep less hours, when I sleep over 10 hours the rest of my day is ruined. Even 10 hours is a lot. Sleep 8-9 hours and you will have more time to be active and feel emotionally  better",
            "tbh, it sounds like you're looking for someone to save you from yourself",
            "Wow I guess maybe I am… But why do I have to be alone while I'm trying to heal myself? I'm not trying to find someone to save me, I just want someone who will be beside me"
        ]
    },
    "i_feel_like_i_cant_handle_stress_like_a_normal": {
        "title": "I feel like I can't handle stress like a normal human. : r/selfimprovement",
        "text_body": "(24 f) I see people around me raising families while having stressful careers. Battling terminal illness, losing children, getting into car accidents, getting a divorce, cheating spouses etc… all these things… and yet. I can't for the life of me handle my pitiful amount of stress without being on the verge of a constant panic attack. I feel so pathetic. I have so much anxiety that I puke every morning when I wake up. (No I'm not pregnant) I try deep breathing, and journaling, and meditation, I'm seeing a therapist, and sometimes I handle things okay. But lately it's just been one thing after another and I feel myself getting weaker and weaker to being able to tolerate everything without breaking down in tears constantly. Today I told a coworker a little too much about my personal life by accident because I'm so stressed. I'm worried I just fucked everything up with my new job by doing that and people are going to gossip. Im worried about my new job in general… I feel like I can't handle it. It's a long drive everyday, and I have to be on call all the time on weekends and after hours. there's no organization or training in the office. Essentially I'm being thrown to the wolves, and yelled at for not knowing how to do things correctly. Being yelled at triggers me, and I have to use a lot of energy to suppress the emotion. There isn't much work other than retail work and warehouse work where I live so I know I should just stfu and be grateful for this job and just “grind it out”.. idk I feel like a normal person could deal with this easily and hide their emotional turmoil gracefully. But for some damn reason I wear my heart on my sleeve and I can't stuff it away and be an adult. I feel like I'm too soft and squishy to even have survived for this long as an adult and I'm taking years off my life span with all this worry… I'm not trying to use any of this as an excuse but how the hell do people do it? I feel completely burnt out, like if there's just one little cherry added to the shit sundae right now I'm gonna lose it.Read more",
        "comments": [
            "Have some patience and self love for yourself. For me personally, I have some trouble identifying with my problems and turning it into my narrative. You are not an anxious person, you are someone with anxiety. You are someone who is working through their problems and making small improvements and learning about life and its struggles. Use the right language to express how you are feeling and who you are honestly. You are someone who is much much more than what you posted here and I know how tough it can be to see through the fog sometimes.Don't worry if you can't do things that others can. Don't try and pick fruits that haven't ripened yet. Best way to learn is to live everyday in the present and observe as much emotions, cause and effects, triggers and warnings as you can. As a casual observer of your post, it seems to me that it's social situations that give you the most stress. That's okay, just recognize instances and realize that you might be predisposed to feeling anxious when dealing with situations like those. Build up from the bottom with solid logic and dispel any wrong interpretations of yourself. These things will come naturally if you don't force things, be patient and kind with yourself.Feeling deeply is not a weakness, but it can have its difficulties you can to adapt to to live a more stable existence. There needs to be more people out there who feel intensely and wear their heart on their sleeve. Try and see if your weaknesses can be strengths and don't be judgemental of your flaws - observe them. I too feel very deeply and makes me emotionally volatile - my highs are really high and my lows are very low. It also makes me more empathetic to others, to care for others deeply, and connect with the world around me in a way that few people can. Who are you? Is the self the you who feels and reacts or the person who observes the feelings? You'll find once you practice observing that it's very difficult to be anxious and to be so emotionally volatile. When things get really tough for me I do my best to observe to enter that meta level of self. Take some deep breaths, find the calmness within to see clearly.Sounds like you're making solid progress - make sure to look back at how far you've come! Also remember being 24 (I'm 24 too) is still just late adolescence. There is no race, no rush - we have lots of time to build the self we want to be. Let's work to be wise people who can help others who struggle in the same ways as us. The next generation of children are dealing with depression and anxiety at a whole new level and they will need teachers like us. That's the narrative I'm trying to live as I deal with similar problems. Good luck friend",
            "Also highly recommend Carl Jung, meditations Marcus Aurelius, Bruce Lee's striking thoughts (my personal favorite) as some readings that have really helped understand myself and inspire me to make improvements",
            "A few things here. Have you heard the analogy about orchids and dandelions? Some people thrive in any enviornment (like a dandelion) and others need a particular enviornment to flourish (like an orchid). People still love orchids though.I also always felt I lacked resilience but having had some therapy I've realised that while I'm definitely more of an orchid than a dandlilion I can control my reaction to stress much more than I think. A big improvement for me was letting go of rigid, demanding thinking. (e.g. I Must pass this exam/get this job/get married by X time) and instead be more flexible (I'd love this job/to pass my exam etc. but if I don't I can cope). I've also found simple stuff like mindfulness, gentle exercise and getting enough sleep enourmously helpful. I also try to practise self compassion. How would you react to a friend who was struggling? You wouldn't say 'other people have it harder you should be able to cope suck it up'. You'd be kind and understanding. Have that attitude to yourself too.",
            "This! The perfect book came to mind: self compassion by kristin neff. Very great book that goes into detail pretty much about everything you wrote.",
            "Take some time out to see a doctor and get a referral for a good therapist.  If your long-term strategy is low anxiety and good mental health, then it is worth the investment now.",
            "I think sometimes people struggle more than you see, but they're just good at holding it together. Give yourself a break. Life's not easy.",
            "I used to be in the same boat. I had panic attacks from driving (something I used to enjoy), I got panic attacks from showering because the sound of the water was so overstimulating. I got triggered by harsh sunlight, shadows from the trees while driving, etc… anything overstimulating. I thought I was an incapable human.Through therapy and my own self-education, I learned to accept my feelings and allow them to be there. Instead of resisting the panic and anxiety, I had to shift my attitude toward, “Okay fine. I'm anxious for now. I don't like it, but it's temporary.” And then I would observe how it felt in my body. That's it. And eventually it would pass and I had to practice not being mad at myself or ashamed that I panicked over something I thought was silly. Feelings are just feelings.This was NOT easy. I had to work with a therapist for months to get to that point. But man, once you reach that point, where you can accept your feelings as they come instead of attaching meaning to them… that's freedom. I started being able to handle more and more (I built up my tolerance threshold).Get comfortable being uncomfortable, and accept all feelings.I'd recommend “Hope and Help for your Nerves” by Dr. Claire Weekes. It's a classic and changed my life in this way.",
            "Hey just want to say please give yourself some grace ❤️ Life is hard and anxiety can make it brutal. It might seem like everyone else can take things in stride. But I guarantee a lot of those people are worried and anxious too. Also - work anxiety is really hard to deal with!! Especially if you're always on call and the environment is toxic. You're not weak or anything for feeling this way. And you're not alone either. Hang in there and I hope you are able to find some relaxing moments in the upcoming days.",
            "I feel the same way.",
            "I'm in the same boat as you. We'll figure out a way. ❤️"
        ]
    },
    "loneliness": {
        "title": "Loneliness",
        "text_body": "No text body found",
        "comments": [
            "No comments found"
        ]
    },
    "loneliness_the_only_constant_in_my_life": {
        "title": "Loneliness - The only constant in my life : r/india",
        "text_body": "I'm suffering from loneliness for more than 10 years. Initially, it was due to bad things which happened in my past, but I kept on chasing people because I didn't want to be alone, and I got in association with toxic people which harmed me. So, due to this impact I distanced myself from everyone to protect myself. I become totally alone, internet was my safe haven. I used to play games, watch movies or read to spend my time most of the times. Initially this was great, but eventually I sank into the ocean, sinking deeper and deeper. The protection that I made became my cage. I feel restricted and more lonely now.So I tried to change about it last year, to come out of my comfort zone and make friends and Initially I was successful I did make friends but eventually they either disappear, ghosted me or we simply lack the connection now.I'm going through a tough phase in my life experiencing failures after failures, and this loneliness in top of that. I'm tired of everything. I lack purpose. I don't know where I'm headed. I want a way out of all this mess, but I don't think I'll be ever be out of this. Loneliness has been craved inside my bones and blood.Read more",
        "comments": [
            "Moderator AnnouncementRead More »Your post title should be an accurate summary of your text post. \"Help Needed\", \"Rant\", \"Unpopular Opinion\", are examples of poor titles.r/Indiais not a substitute for Google. Only post your query onr/Indiaafter you have searched for an answer on the web.Self-posts als#Rule 149 | o have to be specific to India. Don't copy/paste questions fromr/AskReddit.For relationship queries, please also consider:https://www.reddit.com/r/RelationshipIndia/I am a bot, and this action was performed automatically. Pleasecontact the moderators of this subredditif you have any questions or concerns.",
            "Unethical life pro tip: Just make a reddit post saying you are 22FYou will get to make hunderds of friends.",
            "Unethical LPT pro max: post that on popular porno NSFW subreddits, especially gw subs, ame now you have a huge collection of random dick pics in your dms",
            "It won't help much. I don't want to be surrounded by people. I want few understanding connections. If the purpose is different, it won't work.",
            "They are not called friends, they are called creeps.If you know how to monetize them, they are called followers.",
            "Dude, this path won't end well, personally speaking. Please speak to someone quickly as possible. If you want advice, its going to sound lame but I suggest picking up hobbies : art, cooking, literally anything. And invest yourself in that. Its an effective way of keeping the mind distracted.",
            "I know man, I have spoken to people before about my issues. And I am trying to work on myself too, it's just this feeling just comes up sometimes which I'm not able to resist. Distracting helps in the short term but not in the long term. You have to face your feelings eventually, you can't always run from it. The feelings which I have as a long history, and it won't just go away in a short time. It will take a long time. I do lack a purpose now, I'm trying to find it tho.",
            "Bro ig it's very unfair for some people i mean since class 5 i have been lonely... I shifted really far from my school and my locality has hardly any guys uk... No friends as such now I'm 18 and it's so fucked my entire prime teens are gone .... This is really very horrible never enjoyed the friends life thing... + My school was utter shit never pushed it's students for anything good.. i should not say this but ya i even hate my parents for not supporting me whenever I was depressed and so on ... They only made fun of me forever and laughed at my weaknesses.. this has forever left an impression in my subconscious mind filling me with low self esteem... God knows wt lies ahead.. hopefully this loneliness goes away... I tried moving away from my parents but unfortunately couldn't make it to a college outside my city... Literally fucked up... I'm just ranting it out here bro 😭😭😭😭",
            "I suffer from loneliness too. There r more mental disorders too. So i tried to find peace in shows and movies. But these r not working anymore. I have one or two friends online. But they can delete account anyday and move on. It sucks really. And being a nice guy is pretty problematic really imo. We will get used later on in life too. FMLI just have hope only. U should hold onto hope too. 🫂",
            "Take comfort in the fact that you are not alone in this situation.That line from 'Taxi driver' kept coming to my head...\"Loneliness has followed me my whole life. Everywhere. In bars, in cars, sidewalks, stores, everywhere. There's no escape. I'm God's lonely man.\"Reality is it's not loneliness it's you trying to navigate through existential crisis...things get better with time... involve yourself with anything which you find appealing in the mean time...and be ready for the opportunity when it arrive...just don't loose the touch!Sport is the ultimate refresher...try to include that in your life!"
        ]
    },
    "lonely": {
        "title": "We are here for you :)",
        "text_body": "No text body found",
        "comments": [
            "No comments found"
        ]
    },
    "lonely_people_of_reddit_how_do_you_handle_the": {
        "title": "Lonely people of Reddit, how do you handle the loneliness? : r/AskReddit",
        "text_body": "No text body found",
        "comments": [
            "I'm struggling with this a lot since I moved last year. Took me a while to realize it cause I normally love having time to myself, but there's a difference between not knowing anyone and choosing to hang with people on your own time. I've been trying to make myself go out and interact with people (board game night at a local bar) and just trying to organize hangouts with friends of friends and acquaintances and such. The people that have that potential to become friends at some point.It's a slow process though. When you're at home and really hurting, I just like playing podcasts and music. Background noise can be comforting.I feel you on this. It's something I've never really thought about until I realized I was in the middle of it recently, and completely at a loss as to how to take care of myself",
            "I scroll through reddit looking for posts that distract me from how lonely i am.cries in lonely",
            "I just accept it for now. I avoid things that can trigger it too.",
            "i realize that even if nobody wants to be my friend, i can be my own friend. i learned a lot of cool things about myself through being lonely.",
            "You learn to thrive on it. If you're lonely that means you can do whatever you want whenever you want, so just pick something that interests you and dive into it.EDIT: Holy shit woke up to my first gold! Thanks!!",
            "I've learned to accept it.It's tough some days.",
            "By not feeling emotions",
            "I dont. I just suffer. Sleep a lot.",
            "I moved overseas to be an au pair several years ago, and for the first 4 months I was so lonely I thought I'd go insane.I used to listen to the same podcasts everyday to the point where I felt like I was chatting with my friends. I slept with headphones on, listening to the same shows over and over just so I could hear another voice in the room.It was such a bleak time. But it didn't last. I eventually made friends at the language classes I went to every day, and I started talking to a friend from home on Skype regularly, and she was someone I had long fallen out of contact with before I went away. So life will surprise you like that.You can compensate for your lack of companionship by talking to the people you see around you as you go about your day. Chat with the person serving you at a cafe or when you're buying groceries. Stop and talk to the old lady on the street that you normally walk past. You might be the only person she talks to all day. It doesn't matter much what you say, just engaging with people will help you feel less invisible.This loneliness won't last forever. People come in and out of our lives. It's part of the ebb and flow of life. This is a lonely time, but there will be times when you're busy and you'll meet new and interesting people easily. Just take each day at a time, remembering that if one day is bad, the next day does not have to be the same way.This won't last. This is not the rest of your life.",
            "Can I offer any of you a nice egg in this trying time?"
        ]
    },
    "need_your_help_what_actually_works_for_you_to": {
        "title": "Need Your Help: What Actually Works for you to Handle Stress and Anxiety? Do you guys have some tips that helps you calm down quickly? [Discussion] : r/GetMotivated",
        "text_body": "Hey everyone,I'm hitting a bit of a rough patch with stress and anxiety, and honestly, I could really use some advice. I'm trying to figure out what actually works, and I thought, who better to ask than this awesome community?So basically I get stressed a lot (sometimes about things that aren't really that important) but I can't help it. I've read some articles and it's always: practice meditation, exercise, go see a doctor, sleep more... I already tried.. didn't help.. I would love to know if some of you guys have tricks to calm yourself down quickly?please let me know if some of you guys experience this and what did you found effective to calm you down. I hope you're answers will motivate me to chill :)Read more",
        "comments": [
            "A therapist made the following recommendations to us:First - when your anxiety is triggered it's the emotional side of your brain, and like a dog or a toddler, you can't tell your brain to STOP doing something, you have to redirect.  In this case, you have to use the logical side of your brain.  So … numbers!  Count upwards by a not-easy number like 3 or 13.  Play the 7s game where you can't say a number with a 7 in it, nor a multiple of 7.  (So, 1 2 3 4 5 6 beep 8 9 10 11 12 13 beep …)Second - when your anxiety flares up, your body dumps a bunch of adrenaline in your system.  It can take up to 10 minutes for it to clear.  So whatever numbers / breathing / meditation you do?  Do it for at least 10 minutes.Good luck!",
            "Wow, no wonder my ocd, which works with counting and adding numbers, was introduced by my brain to fight social anxiety..",
            "TEN bloody minutes?!?! This explains so much. I need to revisit all the things I said did not work for me. I wish patience was something I could buy",
            "Therapist here (not taking new clients). Themosteffective way to reduce anxiety is to address the source of it, either directly (e.g. do the thing you're avoiding, like taxes or homework) or through insight work (like journaling or therapy). Other tools include diaphragmatic breathing, sensory grounding, progressive muscle relaxation, and exercise. Also, watch your caffeine, alcohol, and pot intake - they can all exacerbate anxiety. Finally, attend to your self-care and biological needs: sleep, nutrition, hydration. Hope this helps!",
            "Look into breathing exercises. Free, easy and you can do them anytime or place. When I'm super stressed I take a walk.",
            "For general anxiety - breathing exercises like other people mentioned can be really helpful. Find a pattern that works for you.For panic attacks - Grounding techniques. Usually name 5 things you can see, 4 you can touch, 3 you can hear, 2 you can smell and 1 you can taste.If you're in a REALLY bad panic attack (this is also used as a method for people with self harming issues), I find holding ice is surprising enough that it'll get me out for a second.",
            "Take your finger and move it like the eye doctor does. Side to side. Slowly. About 6 inches from your face. Focus on it. Do it a few times. It helps me instantly feel less stressed.If you have more time, they have binaural music. Listen to it on headphones and focus on a spot somewhere in the room. I often so it with one hand on my chest, which is where I tend to feel the most stress.Walks are really, really good too. If you have time, listen to music and go for a walk. It fixes so many things.Long term, my advice is to really take a look at what is stressing you and try to make a few changes to your life and how you process stress.",
            "Hey man, also have a stressful job and dealing with more anxiety problems in my early 30s. This is probably not that helpful given your post but I find when my anxiety is building it's almost always because I'm neglecting basic health needs. Food is the first one- if I haven't been eating enough vegetables or haven't been eating enough in general, nutritious foods will have a huge impact on my anxiety levels. I know you said sleep and exercise don't help but for me they are fundamental. I try to run a 5k once or twice a week and the endorphins are like a protective armor against anxiety. Also a huge one for me is caffeine consumption, I never drink coffee anymore because I notice so much more pronounced anxiety when I do. I'll drink a cup of tea in the morning and that's it.A good cognitive behavioral therapist can help. There are some grounding exercises they teach, like paying attention to your breathing rate when you're getting anxious, and slowly tensing each group of your muscles from your toes up to your cheeks progressively to ‘ground' yourself in your body.At the end of the day you have to become cognizant of the circumstances that are making you anxious and take them head on. It might be something you are avoiding that you need to address, whatever it is it can be therapeutic to recognize what is making you feel that way and empower yourself to deal with it.Easier said than done but at a certain point I had to face the fact that I needed a lifestyle change to help my anxiety. Now that I have slowed down my work life and gotten rid of some personal stresses I'm amazed how much better I feel, including the attention I now pay to dietary health and discipline exercising.Failing all of that SSRIs can be a helpful stopgap to take the edge off while you work on more fundamental goals. It's my personal opinion they are a bandaid, but can be a crucial tool to get you going in the right direction. I am sure that for many people with different anxiety experiences than mine, such medications can be a good long-term tool.Best of luck! I promise you can do it!",
            "Go to sauna 2-3 times a week ( my best productivity and mental-health hack)I was quite depressed last year due to some issues in personal life + startup not really taking off.Tried meditation, herbs, sports etc.Then I read an article that Fins are some of the happiest ppl on the planet because they do sauna very often. I never liked sauna. It always felt gross to sit there sweaty with random ppl around.But since I had nothing to loose, I was like fuck it, let's try.First time it felt okeish, and I spent only 5 minutes there. But I forced myself to go again, and again.It took me 8 visits to be able to stay in hot sauna for 15-20 minutes. And once you can sustain that, you can finally experience the healing impact of the sauna.You just feel present, relaxed and not giving a fuck. All your bad thoughts just go aways. You are here and now. And even after you are finished and go home, you still feel much better.My sleep is better, my mood is better and now sauna feels like a drug for me. If I don't go there at least 2 times per week, I feel like something is missing.Don't take xanax or other drugs - GO TO A SAUNA.",
            "When I was a kid I remember conversation between my uncle and my mother. My uncle asked my mother if she was worried about whether or not the Russians would drop the bomb. My mom replied No why would she worry about something she had absolutely no control over.Just had a lasting effect on me. I have over the years developed the ability to not worry about things that are beyond my control. Even things at work where they don't work out the way they should If I have done everything reasonable and they don't work out I don't worry about. There's no real point to it."
        ]
    },
    "practical_tips_to_manage_loneliness_in_the_city": {
        "title": "Practical tips to manage loneliness in the city : r/bangalore",
        "text_body": "Hi there,I see a number of posts here asking for ways to alleviate loneliness in the city. Some say that Bangalore lacks diverse entertainment options compared to, say, Mumbai (the beach?), and this adds to the problem. However, I believe that combating loneliness is more about how comfortable we become with our own company.Here are a few things that helped me manage loneliness several years ago. I hope these work for you too.a) Making the most of day-to-day human interactions.I remember I would strike up a conversation with the chef making my omelet in the cafeteria; being genuinely interested in people helps so much here. (Con: I got free food frequently - doughnuts or pastries that didn't get sold during the day. Not good, absolutely not good for your weight.) If you're taking a cab or auto, “Ootayitha Sir?” is a simple social exchange that can help you feel connected.b) Consider a daily affirmation such as “I am enough, and more than enough.\"c) If you have a strong network outside of the city, please make sure to maintain those bonds. These days, I surprise friends with handwritten letters; it's my way of letting them know they are special.d) Stepping out: Instead of ordering from Swiggy or Zomato, please push yourself to step out. If you feel self-conscious about being seen alone, please know that it's okay to feel that way. We are not born self-assured. We make ourselves. Go through with it, like you would a cold shower in the winter. You'll get used to it eventually. Feeling comfortable in your skin is liberating!Similarly, if you want to go to a movie and don't have company. The last couple of times I went to a movie alone, my neighbors were other folks who had come by themselves. These days I don't bother to check in with pals if they want to accompany me; it's too much of a hassle to ask people and coordinate schedules. People with kids especially can be flaky with plans - I don't blame them. Of course, sometimes I need human company, and I then make efforts to reach out to acquaintances.So, recently I tried to persuade a friend to go to a movie alone, but they found it too awkward. Finally, I suggested we go to the movie together but sit separately, so as to gently acquaint them with the idea of watching a movie alone/relying less on friends for company!e) Letting interactions develop organically: The self-assurance you develop will come in handy even when you go to meet-ups, like Board Games meetups or any social settings. Initiate conversation, make an effort to get to know people, have a welcoming smile, and you will find that acquaintanceships and friendships will develop organically. When you are \"desperate\", it becomes harder for people to gravitate to you.f) Pressure-free socializing: If socializing overwhelms you, please try out options such as Cubbon Reads and Bird Watching groups. Cubbon Reads I hear are a “silent reading” group; people meet in Cubbon Park at a certain time to read, paint, or do any activity quietly. There is no pressure to socialize; you can do your own thing, and bumping into people with similar interests becomes easier. Here are links to the bird walking groups: bngbirds dot com, chat dot whatsapp dot com/ EjzFTpOXHmAIFQmUwfsZGP. These meet-ups are free to attend, they don't cost a thing.g) Showing up: The ‘Putting Scene” Whatsapp group (join dot puttingscene dot com) curates interesting events in the city. I find there is so much to do in Bangalore: so many hobby classes, talks (check out the Bangalore International Center), concerts, stand-up shows...Simply show up; if you are bored or feeling out of place, you can just get up and leave.These are tiny steps to make you feel anchored to your city, however, if you're experiencing clinical depression, please work with a therapist. There is no shame.Read more",
        "comments": [
            "I'm a very extrovert person in a permanent WFH setting who has to stay in the city because my spouse has to go to work. I am the kind that goes to the gym in the morning, and alone to movies.I'd love to show up at events, but with the whole transport and traffic scene in Bangalore - it almost becomes a no-go especially if you don't drive your own bike/car. I find myself putting off plans because frankly I'm too tired to step out.Idk how many people feel the same way, but I wish traveling inside the city was easier. Like it's in Mumbai.",
            "I avoid driving, so much so I haven't renewed my DL. Ride booking apps for the world :)",
            "I've been using an app called Playo, it's great to find players to play a sport with",
            "I don't understand which people find it weird or awkward to go to movies alone, or eat at a restaurant alone! I prefer going to movies alone rather than with company. Not like we need someone to sit with us to explain the plot or talk to us in a movie!",
            "I think it's hard for most people to do that. We've grown up around friends and family for a long time and suddenly when you're put in a situation where you're completely alone, things do downhill. It takes time for people to get used to it. You and me who are used to it, for us it's easier to say hey why people find it awkward. But in reality that's not the case.",
            "Bangalore as a city is something which will never make me feel content. People are rude, auto drivers think they are PMs, Language polarization is getting insane, except Cubbon no green belt where one can to go relax, work out, etc. Food sucks. Water quality is degrading. Spent 4 months there, never going there. Mumbai all the way for me, might be expensive but it feels like home, people are nice, food is amazing, transport facilities do not make you feel harassed and looted, water quality is safest among metro cities in bombay. vibe is different.",
            "Trust me Bombay for real outmatches the friendliness & ease of connecting to other people. No matter how much people hate Mumbai, it still to me comes off as the only true Cosmopolitan city in India. The city that never sleeps still stands true.",
            "Step 1 : delete Instagram 🙂‍↔️- this will give you peace",
            "Feeling the same since the last few weeks, currently my roommate has gone home and there is no one at times to talk too.",
            "Go to a gym, dance class, singing class, swimming, hang around at a cafe, treat talking to strangers as a game"
        ]
    },
    "serious_redditors_what_healthy_ways_do_you_deal": {
        "title": "[Serious] Redditors, what healthy ways do you deal with stress? : r/AskReddit",
        "text_body": "No text body found",
        "comments": [
            "I have an hour commute. In that time I listen to music and generally just forget everything at work and think about getting home to see my wife and cook dinner together.",
            "Some physical things I do:deep breathing exercisesexerciseeat (healthy)clean up -stretchMental:I make a huge effort to program my mind. What you tell yourself is likely to manifest. Conciousnese is the key determining factor of your reality.Do what you need to do. Just knock it out.-meditate (relax each muscle in your body and relax your mind. As thoughts come to you, acknowledge them, and let them go.) Just stay positive and keep the future you want in mind.",
            "Cooking a complex meal with several dishes.It's pretty focusing and definitely keeps you in the moment while your subconscious considers the issue at hand - lot of steps that need to come together so everything finishes at the same time and due to timing, you can't really let your mind/focus get off the topic of bringing everything together. Once it's done, you have a feeling of accomplishment, and a good meal to eat while you ponder the issues that stressed you out in the first place.",
            "Think about the present and not the future. If you feel the need of getting a breather, drop everything in your hands right now and go for it. Take as long as you want.",
            "\"When you come home from work, you should put your work problems down and leave them at the door.\"I carry a bag, so when I put my bag down when I come home I kind of grab a ball of air as though it were the problems of the day and put them figurative in my bag and leave them there.",
            "Some healthy ways I deal with my stress:Go for a drive and listen to musicExercise, especially if you can work some of that frustration out on a punching bagTalk to my brotherCook and enjoy my foodSome very unhealthy ways I occasionally deal with or have dealt with stress:Drink a lotGet into a fist fightSuppress and denyDrown in griefAttack my own property with a crowbar",
            "Running or any kind of physical exercise...It's a proven fact that releases the same kind of \"happiness\" hormones like Xanax and other pills.Also, go to the gym and puch that punching bag really bad, until you are tired...",
            "Yoga. There's a YouTuber who goes byYoga With Adrieneand she has videos foreverything. Yoga for bedtime, yoga for stress, yoga for energy or weight loss or to tone up, etc... I follow her videos nearly everyday and they're great for stress and self confidence. She's really good at getting you to relax and take in the moment and realizing what you're capable of doing.The video I posted above is for relaxation. :)",
            "If im feeling overwhelmed by life or work I will take one of my sick days and just relax. No chores, no errands, no responsibilities. Just go down to the water with a little picnic (phone off) and lay with my dog. That seems to be my rest button when anxiety gets the best of me.",
            "New parent here so stress is my mistress...Leave work and go home.Get home, greet wife, grab baby, insert baby into stroller.Take baby outside, leave phone, headphones, etc. inside.Go for a walk, run, to the pool for a swim, to the park to swing, etc. ANYTHING that will cause me to break a sweat. Do not stop until sweaty, energy exhausted. The point is to get tired.Return home, sit down in front or back yard.Watch life pass by with baby in stroller. Each time brain tries to bring up a stressful \"thing\" to think about, tell brain to FO.Baby naps, wife has time to herself, I am too tired to give a shit about being stressed.Because life is MORE than the shit we stress about. And at times, it can seem that what causes stress, is all that life is. It's not. Get that energy out of your body, and get some perspective back. However best works for you, you don't need a baby or a partner. You just need something that will reset your brain for a bit, that will also make you sleep, feel better."
        ]
    },
    "Stress": {
        "title": "Stress",
        "text_body": "No text body found",
        "comments": [
            "No comments found"
        ]
    },
    "the_real_trauma_starts_the_moment_you_realize_you": {
        "title": "The real Trauma starts the moment you realize you were traumatized. : r/CPTSD",
        "text_body": "No text body found",
        "comments": [
            "I was \"just fine\" for a long time, before I realized the extent of childhood neglect/abuse that I experienced... since waking up to it, my life has been a series of breakdowns/fighting sui*idal ideations/trying to learn how to cope and not just repress.I often wish I could go back to not knowing.",
            "Except,  Not being aware of the damage done to you doesn't mean it's not being done.Just because we didn't realize we were running on a broken leg, Doesn't mean the  Damage isn't happening.It's like a horse that damaged its leg,   was given Stuff to numb the leg  So They can continue running themselves into the ground.Pain has a purpose.   It brings attention to the injury.  The injury is still there whether We are aware of it or not.  The great thing about finally becoming aware of it,  Is that then you can It worked towards healing it as best as possible.  Prevent further damage.",
            "I've felt this too. It's like you're only seeing the mountain you gotta climb for the first time because it was obscured by clouds.I've raged, I've blamed those that opened my eyes. I needed to, it was a necessary part of my journey. It opened the floodgates to the idea that there were floodgates to be opened in the first place.",
            "Me too. Except I was just a walking coping mechanism. Eating disorder, avoidant tendencies, people pleaser to a huge detriment, had no idea what emotions were but they were ruling my life. I was always trying to escape by being so busy and going on these adrenaline seeking adventures.Definitely feeling the trauma more now, but sometimes I wish I could go back to being oblivious.",
            "I didn't realise a lot of the trauma identifiers until I was much older. Especially at suddenly developing severe & chronic migraines that happened daily from when I was 8 years old.",
            "It hit me in November last year. I was drunk and expressing all my feelings of self hatred to my friends. The next day, I got some messages from my boy to talk about what I said and gave me some uplifting advice on how to deal with my own self perception.However, I've come to realise that all the self hatred was really a reflection of all the abuse I faced growing up. It's been fucking with me ever since.",
            "I'm so sorry, I wish I didn't know where you're coming from but I really do.I lived with self-hatred and disdain and passive suicidality for almost twenty years after escaping my abusers (moved several states away from them and cut all contact).  Ten years ago I started developing fibromyalgia pain that turned into wildfires burning all over my body combined with random nodules of inflammation that no one could explain beyond random inflammatory responses aka \"trauma response\".  Only this year did I realize what I thought was normal childhood treatment was really traumatic, especially  by a mentally ill single mother in a high control religious (cult, it was a cult) group.I'm working with a Psychiatrist, Trauma Therapist, EMDR Specialist, and Acupuncturist on trying to get my physical pain under control while also facing the childhood abuse that followed me, fucking with every aspect of my life without my realizing it.  I knew I was running from something, I knew I wasn't built like other people (insert \"not like the other girls\" meme here) but I had no idea what I was going through was pretty classic trauma response.It sounds like you have good friends who care about you and that's awesome.  I truly hope you can find solace and healing but I'm afraid that won't come from further denial.  Introspection sucks but is necessary, healing comes with hard work and self-care and knowing it's okay to ask for help.Be well my friend, take care of yourself, treat yourself as you would a stranger.  With compassion and kindness, you deserve it.",
            "This is so true for me. I'm a CSA survivor and besides trying to delete myself when I was 12, I was a regular teen with a bright future... until I remembered everything when I was 18 and a boyfriend found evidence and questioned me. I went catatonic, had my first bipolar episode and my capacity to live a regular life ended just there.",
            "Agreed, Denial isn't just a river in Egypt.I lived in chronic pain for a decade but only realized in January 2024 the true extent of the origins of that pain and I hate it.  It was a culmination of carrying 17 years of abuse, unrealized, ignored and pushed down out of desperation in wanting a \"normal life\".I hate how saturated I am by what was done to me, I feel it in my DNA now.  I had so many \"traumatized child\" symptoms but no one ever put the pieces together, least of all me.  I just thought it was normal to live like that, to be hurt like that, ignored until someone needed to take out their anger on something, c'est la vie right?I've forgotten who I was, who I was supposed to be.  It fucking sucks waking up.That said, I wouldn't go back to before my realization, you couldn't pay me to do that again.Denial was worse, at least now I know what happened to me and I can focus on giving myself the support I never had as a child.  I can reparent myself, I can make a positive difference for others who were hurt like I was hurt.  Never again will I allow myself to think I'm a loathsome, unlovable, object only worthy of the notice of others for abuse, derision, mocking, or disdain.  Never again!I deserve so much better, so do you, it's just that no one ever bothered to tell us that before.  What seems obvious to most is something we struggle to understand.  We deserve, deserved, better.  Healing hurts like a son of a bitch but it's necessary.  Re-wiring the brain isn't easy, undoing all that damage isn't easy, or quick, or enjoyable.  But it is worth it.I hope you continue your journey toward healing, OP.  Hang in there, you're not alone.",
            "The grief of the grief is the worst"
        ]
    },
    "traumatoolbox": {
        "title": "Trauma Toolbox: peer support for survivors",
        "text_body": "No text body found",
        "comments": [
            "No comments found"
        ]
    },
    "whats_your_trauma_and_how_does_it_impact_your_day": {
        "title": "What's your trauma and how does it impact your day to day life? (It's a safe space , you can share) : r/delhi",
        "text_body": "We all carry some or other forms of trauma. What are the traumas that you suffer from? How does it affect your mental health, your relationship, your work life , your day to day?Mine : I have(had) fear of abandonment cos I lost everything and everyone in life since a kid. Lived years in hostel and never felt wanted or loved. I like being sad cos it gives me a outlet to blame things. I have worked on it and it's 70% better but that 30% still linger.I have this hunger/need to be loved and validated. To be heard and appreciated. Which sometimes makes me go the route of people pleasing.Read more",
        "comments": [
            "Lost my father(57M) a year back , like in the morning he left for work and two hours after that we received a call from his office that he had seizures and he was rushed to the hospital. He had a brain haemorrhage due to elevated BP and blood went into his mid brain section. He slipped into a coma and three days later doctors told us that he will not make it and asked us to make a choice whether we wish to continue treatment or not (basically asked me to make a choice between k_illing my father or making him suffer). Seeing my father in ICU like that in a hospital like environment with beeping machines, Lyzol smell etc. Had an impact on me. Finally when the day came where I had to sign a form stating that we don't wish to continue the treatment and I signed it.Now on how it has affected me, whenever I hear a beeping sound, like seatbelt alarms in a car. I get flashbacks of my father in that comatose state. Many a times, I have lashed out on my friends when they don't put on their seatbelts and that fucking thing keeps on beeping.Whenever I have to sign something, I am reminded of that form that I signed to set my father free, and I just think did I rush into that decision, would my father have made it back, I try not to think of it. But it just catches up.",
            "Man this is traumatic. Wish i could give you a hug. I lost mine when I was 7. He was kidnapped and killed*, we never found his body. sometimes I wish his life would be with him.The thing about life is that it moves and and so does we but that empty space will always hurt us.More power to you bro. Keep doing what you love.",
            "Had two serious relationships. First one left because his feelings for his childhood best friend “resurfaced”. Second one could never de-pedestalize his ex & insisted on keeping his printed photographs with her even though he had been with me for 2 years and had all his instagram posts with her in the “archive” (not deleted). Worst part is, she spits on him & spews hate towards him at every opportunity. Jeez. Now all men seem fake and cynical. The love of my life could sit right next to me and I don't have any energy left to even as much as look at him. Seems like I have nothing left to give",
            "Yes i can understand that it must be hard for you. To love and not receive back. Take your time to heal but don't be scared to love or be loved.Don't be scared to walk cos you fell twice. Heal your wound, learn the slippery slopes and carry a stick but don't stop walking",
            "feelings of being unworthy, unloved, selfishness , being a bad person or someone who is a loser and too tired and damaged to do shit, feelings of being rejected and left out in the cold by everyone they meet, not being able to trust anyone, never been chosen by anyone, being lazy, too depressed to function, addictions, feeling like a burden, not being independent or accomplish anything, heartless, cold, too sensitive, being different and not able to fit in, feelings of unseen,unheard and not understood, being a burden,conflicts with family, health issues, self hate and doubt, being of no use",
            "I have this firm need for someone to love me. Leads me to being in prolonged relationships just because I'm scared of losing the person and staying the rest of my life alone.",
            "Oh nothing, just physically repulsed by anyone touching me in the most populous country in the world. Shaking hands with people is fun when you die inside everytime. Metro is fun too🌚 we carry on though. Freeze up if someone touches me without any intimation... handshakes are okay since I brace myself and know it's coming. Can only safely touch few people without wanting to kms. Haven't told anyone I personally know about it but can share it on social media though, as far as why I have this phobia, I'd rather not get into it.",
            "Going through a lot and cannot cry, can't access my emotions, everything is buried inside a ball of anger",
            "My trauma was and is related to marriage. I was 17 when it all started. My father died when I was 9 so the only fatherly figure I had in my life were two people and those were both my grandfathers. When I was 17 one of my grandfather(saying GF1) was diagnosed with Alzheimer's and Parkinson's disease so he had  stopped communicating with me and couldn't form his thoughts properly.although he died later but you can say that I lost one of my fatherly figures then. I don't want to make this about myself,  he was the one who got diagnosed with those diseases and suffered everything but I am telling you how it impacted me. The same year my other grandfather (GF2) died. So now I had no fatherly figure left to help me in any situation. I had always craved and still crave a trustful,  shielding, safe, and secure male support figure in my life. But that is a topic for another time. my bua (father's sister) had the keys to GF2's locker and essentially all the money he had left for me and my brother that was important cause my mother was a housewife and the only source of income we had was what GF2 gave us at the time. So my bua decided that she will only give us everything that my GF2 had left us  if I got married at the age of 18. My mother is not a very strong woman and she had always thought that my bua was a wise and trustworthy person. So she could not refuse her quickly that made me question my mother. How can she think about almost selling me for what this woman was saying. Something that made me loose trust in my mom was also that how can she think of 'making' me marry someone without asking for my permission? Like i was a thing not a human. I would cry silently but violently in my bathroom whenever my bua came to my house and brought up the topic of marriage and later whenever she came to the house i couldn't face her cause I was too scared of her. I would always run into the washroom and cry like crazy and with the running water i would pray that this was all a nightmare. Later I found the courage to tell my mom that I won't marry anyone and especially not if she 'tells' me to marry someone i don't even know. I kept telling her that my bua isn't a good lady and she isn't trustworthy but my mom refused to see the truth it's probably because she also craved a stable human support system that she had lost both my GF1 and GF2 too. Fast Forward to Today 8 years later  we are fighting a case against my bua and my mom now understands that she isn't a good woman. I still sometimes think that my mom wants me to marry someone but that is not her decision to make. It's mine. But i still have trauma left and I know that because the word marriage scares me illogically. If someone in my family tries to bring it up my mind  quickly thinks that they are trying to make me marry someone and then I cry. I am 25, i don't think Ive crossed an age to marry someone but I am still very far away from marrying someone. I don't think by the time I am ready someone will actually marry me. I recently got diagnosed with Pseudo dementia and now on some very high psychiatric medicines and that alone might just be a very big reason to not marry someone. Don't want to ruin their life being all the crazy that I am. I recently drove away my very good support system and a man who was the closest  ever to being a potential boyfriend because I was so irritating and unsure and taking back my words so often because of Pseudo dementia. I don't know if I'll be up for opening up with another man in the the near future. Maybe later. Until then i need to heal first. Cause hurt people hurt people and if you don't heal from who cut you, you'll bleed on the people who didn't hurt you.",
            "Same trauma as yours.I react in an opposite way though. I abandon people before they get a chance to abandon me. Putting up a tough persona who doesnt give a f about anyone. I can be really good friends with someone, and then ghost them the next day forever. Its a toxic trait now, cuz I have started feeling good … maybe its just an escape mechanism.. but who cares…"
        ]
    },
    "what_immediately_tells_you_that_a_person_has_had": {
        "title": "What immediately tells you that a person has had traumatic childhood/past? : r/AskReddit",
        "text_body": "No text body found",
        "comments": [
            "How they normalize the abuse they received. I had one of my close friends over for dinner once and my little sister who was 6 at the time accidentally dropped her cup on the floor. It wasn't a big deal it was a plastic cup so it was just juice. My parents reaction completely shocked him. All they did was get some napkins and dried it up and got her some more juice. It didn't seem weird to me at all but later when we were alone he told me while laughing when he did that at her age his father smacked him in the face. I was just like a grown ass man smacked a 6 year old in the face for spilling some juice? He told me the way I said it like that it sounded fucked up. That's because it is fucked up but he remembered it like it was a funny childhood memory.",
            "They seem more aware of their surroundings and the people around them. This either manifests as them being extremely empathetic or extremely closed off as a defence mechanism",
            "When something good happens to them (like a promotion or something romance-related) they get worried instead of happy",
            "When they suddenly seem unusually scared or vigilant around a certain type of person, even though they have never met that person before.",
            "If they go out of their way to make/keep everyone happy.  My mom would fly off the handle at a moment's notice and I would have to always be hyper aware of where she was at all times and listen for footsteps to see who it was walking around.",
            "Saying sorry all the dang time.I had this one co worker who wanted to show me her cats and as she was opening her phone she made a mistake and dial the wrong passcode number and had to try again saying sorry and said she should've use Face ID like normal people. And said sorry again. Then nervous laugh.",
            "As a kid I used to think children usually don't like their fathers and are afraid of them, because I thought fathers always beat their kids. My father lives in another state for work, and so did some of my friends' fathers... One day, one of my friends said his father is visiting and I immediately felt bad for him. I made a sad face and looked at him. For my huge fucking surprise, he was genuinely happy, I could see it in his face as he told me the news.It would since take me a few weeks to get out of the confusion and realize that other fathers are usually sweet.But yeah, the torture that my family would get from that individual would just increase over the years.I just graduated and got my first job, I'm planning on moving away from him with mom and sis and arranging therapy for all of us.",
            "No sense of achievement, if they succeed they are relieved, not proud.Constant awareneness and anxiety. Knowing where people are at all times around them.Suddenly being worried by something. It's always their fault.Edit I never expected this many upvotes but just know that this is my experience you might be different I hope we all survive.",
            "Major lack of confidence"
        ]
    },
    "what_is_considered_trauma": {
        "title": "What is considered trauma? : r/malementalhealth",
        "text_body": "So the other day when I saw my counselor she mentioned that I basically don't have a really traumatic history. Obviously this is a good thing but it made me wonder what is really considered trauma. Any examples or help would be awesome thanksRead more",
        "comments": [
            "anything that triggers intense emotional responses, short term or chronicallyu/kegerboy3, that's something a lot of folks don't know. Trauma isn't always (or even usually) just a single harmful event. It can be a few big events, a lot of small events, or anything in between. Trauma isn't only defined by the peak of stress and strain, but by how often it happens.",
            "Can you give an example of an intense emotional response?",
            "One possible definition of trauma, by Gabor MatéA lot of what you talk about is childhood trauma. What's your definition of trauma?It's important to define it actually, because people use the word  like ‘god' and who knows what somebody means when they say ‘god'. It  could be a punitive, dictatorial father figure with a white beard and  somebody else might mean the essence of pure love in the world.The origin of the word ‘trauma' is the Greek for ‘wound'. Trauma is a  wound. How I think about it is that if I wounded you, if I cut your  flesh, the healing would involve scar tissue forming. If the wound was  great enough, you'd get a big scar, and it would be without nerve endings so you wouldn't feel, and it would be much less flexible than  your normal tissue. Trauma is when there is a loss of feeling and there  is a reduced flexibility in responding to the world. This is a response  to a wound.Trauma is a psychic wound that hardens you psychologically that then  interferes with your ability to grow and develop. It pains you and now  you're acting out of pain.It induces fear and now you're acting out of fear. So without knowing  it, your whole life is regulated by fear and pain that you're trying to  escape from in various ways.Trauma is not what happens to you, it's what happens inside you as a result of what happened to you.Trauma is that scarring that makes you less flexible, more rigid, less feeling and more defended.(complete interview here:https://humanwindow.com/dr-gabor-mate-interview-childhood-trauma-anxiety-culture/?fbclid=IwAR3DrRguOQR6FLBm_VpkhRMtXMuJ6sgl9PlMbh45nWAFf7JFlGbmsBpuVps)",
            "That description is the best analogy i have read on the theme. Thank you for sharing ❤️",
            "ho...ly... shit...",
            "My psychiatrist thinks I have PTSD and she described what could cause PTSD which is a feeling of intense horror and helplessness. This could be a more extreme version of trauma but that's my understanding of it at least in regards to me.",
            "These can be chalked up as traumatic experiencesdivorce/infadelity witnessed at a childrape or molestation by a friend/ family member/ strangergoing to war/being in a war zoneexperiencing one of the many mental illnesseswitnessing a killing/shootingaclose loved one passing away unexpectedlygoing to war/ being in combatliving in a war zoneBeing kicked out of your home at a young age or when you need help the mosthomelessnessAn ongoing alcohol or drug addictionbeing forced into prostitutionabusephysical and psychological abuse at the hands of someone you trusted such as family or friendsbeing bulliedgoing to jailbeing in a gang/ experienced gang violencebeing cheated onbecome beat up or jumpedwitnessing a natural disasterbeing trapped in a home as a teenager/young adult with psychological, emotional and physical abuse and having no way to escapeself harming in order to cope with mental illnessgoing to a psychiatric facility (especially more than once)attempting suicide or a loved one attempting suicidebeing chronically ill and it not being taken seriouslyprolonged financial insecurity (exp. having to choose between food, or gas to get to work)I mean, these are just the ones that I can think of at the top of my head, there are SO many more. Trauma is any experience that was real to YOU, and that caused you great psychological hard. And it's all valid.",
            "Whatever is going on with you it isn't any less valid just because you've never had anything traumatic happen to you.Your councilor is probably just trying to narrow down on how to help you.  You treat anxiety different than you do PTSD, depression, psychosis, etc.  I think there are some standard questions they go through to figure out where you land. So she might have said that to double check with you that she was correct.  I doubt she meant anything more than that when she said it.",
            "Anything that triggers a severe emotional response. No one gets to tell you, especially when comparing to their own traumas, what is traumatic. What may be traumatic for you could be totally different from them. So while evoking an intense emotional response is what someone would put down on paper - never let someone tell you what you're allowed to be traumatized by ❤️❤️"
        ]
    }

}